import 'package:age/age.dart';
import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:new_chat/widgets/from_XD/XD_userInfoHeader.dart';

class UserInfoTestScreen extends StatefulWidget {
  final String userName;
  final String roomID;
  final String userEmail;
  final String userImage;
  final DateTime dob;
  final bool isMale;
  final bool dobAndMale;
  const UserInfoTestScreen(
      {Key key,
      this.userName,
      this.roomID,
      this.userEmail,
      this.userImage,
      this.dob,
      this.isMale,
      this.dobAndMale})
      : super(key: key);
  @override
  _UserInfoTestScreenState createState() => _UserInfoTestScreenState();
}

class _UserInfoTestScreenState extends State<UserInfoTestScreen> {
  AgeDuration age;
  DateTime today;
  bool gender = false;
  DateTime dateDOB;

  @override
  void initState() {
    // TODO: implement initState
    SystemChrome.setEnabledSystemUIOverlays([SystemUiOverlay.bottom]);
    super.initState();
    today = DateTime.now();

    // Find out your age
    if (widget.dobAndMale) {
      setState(() {
        gender = widget.isMale;
        dateDOB = widget.dob;
      });
      age = Age.dateDifference(
          fromDate: dateDOB, toDate: today, includeToDate: false);
      getAstrology(dateDOB.month, dateDOB.day, gender);
    } else {
      getGenderAndDOB().whenComplete(() {
        age = Age.dateDifference(
            fromDate: dateDOB, toDate: today, includeToDate: false);
        getAstrology(dateDOB.month, dateDOB.day, gender);
      });
    }
  }

  Future getGenderAndDOB() async {
    await Firestore.instance
        .collection('users')
        .where("email", isEqualTo: widget.userEmail)
        .getDocuments()
        .then((value) {
      value.documents.forEach((result) {
        setState(() {
          gender = result.data["isMale"];
          dateDOB = result.data["DOB"].toDate();
        });
      });
    });
  }

  @override
  Widget build(BuildContext context) {
    return age == null
        ? Container(
            height: 100,
            width: 100,
            child: Center(
              child: CircularProgressIndicator(),
            ),
          )
        : Stack(
            children: [
              Scaffold(
                backgroundColor: Colors.white,
                body: XD_userInfoHeader(
                  userImage: widget.userImage,
                  userName: widget.userName,
                  userEmail: widget.userEmail,
                  age: age,
                  isMale: gender,
                  userAst: astrology,
                  astrologyDiscribe: astrologyDiscribe,
                  roomID: widget.roomID,
                  type: type,
                  color: color,
                  numbers: numbers,
                ),
              ),
            ],
          );
  }

  String type = "";
  String color = "";
  String numbers = "";
  String astrology = "";
  String astrologyDiscribe = "";
  getAstrology(int month, int day, bool male) {
    if (month == 3 && day >= 21 || month == 4 && day <= 20) {
      astrology = "الحمل";
      type = 'الناري';
      color = 'الأحمر';
      numbers = '1 - 8 - 17';
      if (male) {
        astrologyDiscribe =
            "الرجل الاكثر اثارة وغرابة في الحب يتوهج تارة ويبرد تارة أخرى لذا ننصح المرأة التي تميل الى الاستقرار بعلاقاتها أن تبتعد عن رجل هذا البرج .. عندما يحب فانه يعطي كل ما عنده بنبل وجدية وتظهر عليه علامات الحب من شرود وتنهدات ويعد الاخلاص والصدق من أهم سماته فهو يخلص لحبيبته حتى في تفكيره لكنه يحاول أن لا يظهر لها ذلك وينتظر مقابلا منها فعليها أن تحافظ عليه وتخلص له اخلاصا تاما وتحاول ارضائه دائما بأن تحب ما يحبه وتكره ما يكرهه وتقف معه ضد أعداءه ويتوقع منها المغفرة والنسيان لأخطاءه مهما بلغت من الأذى لها وان فشلت تركها ليذهب الى حبيبة أخرى ترضيه واذا ما تحطم حبه يلملمه ويحاول بث الروح فيه من جديد أما اذا عجز عن ذلك ذهب للبحث عن حب جديد .. ومن أهم ما يجعل الحمل يترك محبوبته ويبحث عن اخرى اذا حاولت النظر الى غيره فهو رجل غيور محب للتملك واذا حاولت امرأة التقرب منه بالغزل الصريح فانه يلغي التفكير فيها بشكل تام.";
        astrologyDiscribe +=
            "يعد التمرد والتحدي من أهم صفاته لذلك كثيرا ما يقع بالمشاكل ويتعرض لعقوبات قاسيه من سلطته بسبب غروره وعدم انصياعه للأوامر فهو لا يفضل دور التابع أبدا ويحاول دوما أن يكون سيدا لاعتقاده بأنه الأذكى وان فقد رجل الحمل شعوره بالصدارة سواء بالبيت أو العمل فانه يتحول الى رجل كئيب منطوي فاقد للحيوية والايجابية.";
        astrologyDiscribe +=
            'رجل هذا البرج كما ذكرنا يعشق كونه في الصدارة فاذا ما عدنا وتحدثنا عن علاقته بمحبوبته فانه على استعداد دائم أن يبذل كل ما لديه في سبيل ارضائها فيقوم بالانفاق عليها بسخاء وهنا نوجه ملاحظه الى شريكة رجل الحمل بأن تكون مدبرة وتدخر لأوقات الحاجة التي يمر بها كثيرا هذا الرجل لايمانه بالمثل القائل "اصرف ما بالجيب يأتيك ما في الغيب" وكنوع من الاخلاص للمحبوبة يصر رجل الحمل البقاء الى جانبها عند مرضها والاهتمام بها ومدحها والثناء عليها منميا لديها شعورها بالانوثة واذا ما حدث بينهما سوء تفاهم ليس لديه أي مشكلة بأن يبادر بالاعتذار حتى لو كان الحق معه انه يجعلها سيدة النساء وأكثرهن سعادة في حبه لكن بشرط أن يبقى هو السيد صاحب الصدارة في هذه العلاقة والا تركها بلا تردد ومن غير عودة.';
        astrologyDiscribe +=
            'عندما يكون الرجل الحمل في بيته كما يريد "السيد" فانه يكون رجلا محبا لأولاده موفرا لهم جميع وسائل الفرح والمرح والنزهات واللعب والعزومات خارج المنزل ويشاركهم ذلك من غير تردد ويكره رجل الحمل أن تهمله زوجته لأجل أبنائه أو لأجل عملها الذي لا يعترض عليه بشرط الاهتمام به وبنفسها بمحافظتها دائما على أنوثتها وجمالها والأهم تبعيتها التي تمنعها المس باستقلاله لكنها تستطيع التدخل في شؤونه ان كانت تملك الذكاء بأسلوب لبق وبوقت مناسب مع اشعاره دوما بأنه السيد ورجل الحمل يكره الكذب والتحايل وهو دائما صادق مع زوجته في جميع تصرفات واذا شعر بالبرود تجاهها فانه لا يستطيع اخفاء ذلك فنبرة صوته وايماءات وجهه وجسده تفضح مشاعره';
      } else {
        astrologyDiscribe =
            "تحلم المرأة الجدي دائما بالحب والمواقف الشاعرية وتحاول أن تحصل عليها مع رجل يقدرها ولا تتردد في أن تكون المبادرة في المصارحة عن مشاعرها لكنها لا تتردد أيضا في الاستغناء عن هذا الرجل اذا ما حرمها الاهتمام بنفسها وبمحيطها فهي امرأة مستقلة تشعر بقوتها لذلك قد تهرب من الرجل الذي يأتي لمصارحتها بحبه ليس كرها له وانما خوفا على نفسها من العبودية والتبعية وفقدان القوة ..";
        astrologyDiscribe +=
            'امرأة مكتملة الأنوثة تتحلى بالصبر والمثابرة والثبات والقوة لمواجة كل ما يعترض طريقها للوصول الى هدفها امرأة لا تعرف الفشل وتؤمن بمقولة "ان غدا لناظره قريب" امرأة محاورة الا أنها معاتبة وتبكي بحرقة أحيانا صادقة مخلصة متفائلة ومؤمنة ابتسامتها دائما مشرقة لكنها انفعالية سريعة التعصب لكنها أيضا سريعة الهدوء هي بألف رجل عند الضرورة عندما تحب تكون أنانية به غيورة عليه تعطيه أضعاف ما تطلب منه كريمة عليه بمالها ووقتها الا أنها تبقى محتفظة بشخصيتها القوية المستقلة المتميزة بالاثارة ولا تسمح لها بالذوبان فاذا مس الحب كرامتها قتلته ودفنته كما تحب من رجلها أن يكون صاحب شخصية قوية معتدل العاطفة لا باردا كالثلج ولا عاشقا متوهجا بلا كرامة.';
        astrologyDiscribe +=
            'امرأة تكره الفراغ وعلى الرغم من كونها ربة منزل من الطراز الأول الا أنها تؤمن بأن لها دور أهم يتعدى ذلك لهذا فهي امرأة عاملة تبرز في عملها واذا أحبت عملها فانها من الصعب أن تتركه حتى في سبيل من تحب ومن أكثر ما تفضله امرأة الحمل الحصول على الاهتمام والعناية من الاخرين وخاصة زوجها وتفرح بالمعجبين من حولها لكنها بالمقابل لا تفرط بمن تحب ولا تجعله يشعر بالشك أو الغيرة.';
        astrologyDiscribe +=
            'امرأة الحمل هي أم حنونة تهتم بأولادها بشكل كبير تدللهم وترعاهم وتصطحبهم للتنزه واللعب وتتبادل معهم الأحاديث الا أنها أم صارمة صاحبة قوانين وأنظمة حريصة على تربيتهم بالشكل الصحيح الذي يبعدهم عن الفساد والضياع وكذلك هي زوجة حنونة طيبة واذا ما لقيت الرجل المناسب فانه سيكون من أسعد الرجال';
      }
    } else if (month == 4 && day >= 21 || month == 5 && day <= 21) {
      astrology = "الثور";
      type = 'الترابي';
      color = 'الأخضر و الوردي';
      numbers = '2 - 6 - 9 - 12 - 24';
      if (male) {
        astrologyDiscribe =
            'لا نكون مخطئين إذا استـنـتجنا مما ذكرناه في صفاته العامة وطفولته أن رجل برج الثور حريص رزين قليل الحركة بطيء التفكير، لكن الخطأ كله أن نعتقد أنه بارد الشعور عديم العاطفة كما يتصوره البعض، أمر لا يُصدق ولكنه الواقع: هذا الإنسان القوي الضخم يُسيره كوكب السلام والحب المعروف باسـم فينوس أو الزهرة، من النادر أن يقع في الحب من أول نظرة، أو أن ينغمس فيه حتى أذنيه بالسرعة التي اشتهر بها البعض، لكنه متى استقر رأيه وتأكدت له حقيقة شعوره اندفع نحو مصدر إلهامه وحبه بكامل ما يملك من قوة وحيلة ووسائل، وهو في هذا المضمار لا يعرف الكلل والملل، يدأب مثلا على إرسال الأزهار إلى الحبيبة يوميا، يستعين على صدها ودلالها بالشعر أو الغناء أو العزف أو الرسم أو أي ملكة أخرى يتمتع بها، وبما أنه شهواني الطبع يطري مفاتـنها الجسدية كنعومة جلدها أو جمال شعرها أو شذى عطرها، قد لا يكون أسلوبه في التعبير رفيعا وشاعريا إلى الدرجة التي يُجيدها البعض ولكنه يعرف حتما كيف يُلين قلبها في النهاية بفضل التكرار والمثابرة، ويطغي عليه عامل التناقض في جميع تصرفاته وتحركاته، مثلا قد يُهدي حبيبته يوما معطف فراء باهظ الثمن، وتمر الأيام تلو الأيام دون أن يُقدم لها شيء، ثم فجأة يشتري لها باقة بنفسج متواضعة من بائعة عجوز ينقدها أضعاف الثمن لا لسبب سوى أنها تـُذكره بأمه.';
        astrologyDiscribe +=
            'يُضاف إلى هذا أن وسائل التعبير عنده متعددة متلونة، يلجأ تارة إلى أرقى الفنادق والمطاعم، وأخرى تكفيه نزهة في الغابة أو سباق في ضوء القمر، كثيرا ما يعتمد على الموسيقى والأغاني لشرح مشاعره، ولا يُستبعد أن يختار أغنية أو لحنا معينا يرمز به إلى مكانة الحبيبة عنده، إلى جانب ذلك نجده واقعيا قليل الأحلام لا يستعمل لغة الأوهام كغيره من المحبين، فبدلا من أن " يقطف لحبيبته النجوم والقمر وينقلها على بساط الريح إلى جزيرة بعيدة لا تضم سواها "، وبدلا من كر الكلام والأحلام يأتي إليها حاملا بيده خريطة منزل من حجر وإسمنت حقيقي، إذا وعد وفى وإذا أقدم على مشروع حققه من حسابه الخاص لا بالدين أو الرهن أو غير ذلك، وهو أيضا مخطط بارع، يسخر حاضره لغده، كالسنجاب النشيط الذي يجمع في الصيف غذاء الشتاء.';

        astrologyDiscribe +=
            'لا نستطيع القول أن حياة المرأة مع هذا الإنسان سعادة مستمرة، وخصوصا إذا ظهر منها ما لا يقره، من الأشياء التي يبغضها فيها الصراخ والعنف والتحدي، ومع أنه يُقدر الذكاء إلا أنه يُفضل عليه المنطق والرجاحة، من الخير لزوجة مولود برج الثور أن تتصرف بصورة لائقة في الأماكن العامة وإلا واجهها أحد احتمالين : إما أن يرد بعنف يصل إلى حد الصفع واللكم أو يتظاهر بالإهــمال والاحتــــقار، وفي كلا الموقفين ما يُربك الزوجة ويُخجلها دون ريب، ومن الأفضل لها أن تصون كرامتها في البداية.';
        astrologyDiscribe +=
            'من ناحية أخرى يهوى رجل برج الثور الريف والطبيعة والأزهار والنزهات الطويلة وكرة القدم وصيد الأسماك والتخيـيم في الهواء الطلق، كما يحب المطالعة ويُفضل الأبطال والناجحين على القصص البوليسية المعقدة أو المواضيع الفلسفية العميقة، ومع أنه يرتاد المطاعم والفنادق إلا أنه يُفضل طعام البيت ويتمنى أن تـُجيد زوجته الطهو ولو اضطرت إلى تعلمه من كتاب أو صديقة، ذلك لا يعني أنه يريدها طاهية لا غير، والبرهان على ذلك دعواته المتكررة وإغداقه الثياب والحلي عليها وكل ما من شأنه أن يُظهرها بالمظهر اللائق.';
        astrologyDiscribe +=
            'يقوم رجل برج الثور بدور الوالد على أفضل وجه، فهو يعتز بأبنائه الذين يحملون اسم العائلة، ويخص بناته بالعطف والدلال، وهو صبور طويل البال لا يُسيئه مثلا أن يتعلم أولاده ببطء ما داموا مستمرين في التقدم، ومن الصفات التي يسعى لتنميتها فيهم الاعتدال والطموح والمحافظة على المال والأملاك، وهو فوق ذلك سخي لا يبخل عليهم شيء، ولكنه لا يتردد في تأديبهم متى دعت الحاجة إلى ذلك، وبما أن رجل برج الثور دؤوب كثير العمل فإنه يحتاج إلى الراحة بين الحين والآخر، فإذا لم يجدها أصبح قلقا عصبي المزاج، يسيئه جدا أن يتهمه البعض، وخصوصا زوجته، بالكسل، إنه بطيء ولكن غير كسول، والزوجة الفطنة هي التي تدرك الفرق بين الظاهرتين، من ناحية أخرى إذا أرادت حقا إسعاده وإرضاءه عليها أن تخصه بمقعد وثير يؤمن له الراحة والاسترخاء، وأن تحيطه بجو ساكن تتخلله الموسيقى الخفيفة، وأن تغطي جسمه في أوقات البرد بغطاء صوفي ناعم لأن من طبع هذا الإنسان حب الأشياء ذات الملمس الناعم.';
        astrologyDiscribe +=
            'إذا تأمنت جميع هذه الشروط لرجل برج الثور أصبح من خيرة الأزواج إن لم يكن أفضلهم، يكفي أنه في حالات الشكر والامتنان يغض الطرف عن أخطاء كثيرة ينتقدها الرجال الآخرون في المرأة عادة';
      } else {
        astrologyDiscribe =
            'ان أكثر الكلمات تعبيرا عن طبيعة امرأة هذا البرج الكفاءة والقدرة العجيبة التي تطال النجوم، فعندها من الصبر والتحمل ما يُـثير العجب، ولديها من الهدوء والبرود ما يفتقده الكثير من الرجال، وإذا أجبرت على تحمّل المسؤوليات أدت واجبها على أحسن وجه، ومع ذلك قليلا ما تتمنى تحمل المسؤوليات والادلاء بالاراء الحاسمة لأن فأنوثتها ترفض ذلك، وهذا ما يجعلها تطلب رجلا قويا يُديرعنها القيادة ويتركها هي لوظيفتها الطبيعية.';
        astrologyDiscribe +=
            'انسانة مستـقيمة وصادقة من النادر أن تفقد سيطرتها على نفسها، تخفي تحت هدوئها مشاعر شهوانية يلزمها رقابة وتوجيه، من أهم ما تتميز به سهولة التكيف مع المحيط شرط أن يكون أناسه بسطاء صادقين مع أنفسهم ومحبين لغيرهم مبتعدين عن الادعاء، إذا ميزت البعض منهم وأحبته شاركته أفراحه وأحزانه، وإن كرهته أظهرت عدم مبالاتها به وابتعدت عنه بصمت، بطريقة أخرى يمكنا القول أن هذه الانسانة لا مكان في قلبها للحقد والكراهية والحسد.';

        astrologyDiscribe +=
            'لا يمكن اثارة غيرتها بسهولة، وهي تختلف في هذا عن الكثير من النساء، تغض الطرف إذا ما قام حبيبها بممازحة غيرها من النساء أو الاطراء على جمالهن أو تقبيلهن ببراءة، لكن اذا تخطى الحدود النتائج تكون كارثية، فتسقط الأقنعة في هذه اللحظة وتتحوّل من ملاك عذب الى زوبعة ناطقة.';

        astrologyDiscribe +=
            'امرأة ذكية وفطنة، تستطيع المشاركة بالحوارات الجدية والمناظرات العلمية والسياسية، لكن قلما تطمح إلى الخوض في هذا الميدان لأن أهدافها الأساسية أبسط من ذلك فهي قريبة أكثر إلى المنطق والواقع، لا تهتم للشهادات العالية بقدر ما تهتم للمعرفة والاطلاع، لهذا السبب نجدها ملتزمة بالمبادئ الرئيسية لكل مادة وموضوع متخلية لغيرها عن التعقيدات والاجتهادات المتنوعة فكريا، هي مثالا للمرأة العملية التي تقف على أرضية صلبة، فهي لا تستسلم للأحلام وتبتعد عن الأوهام، تستخدم حواسها في العمل، ومن خلالها تتـقبل الأشياء وتـقتـنع بها، لذلك فهي تكره الورود الاصطناعية لافتقارها للرائحة الزكية والحيوية، بالمقابل هي لا تستطيع العيش دون ورود ونباتات لكن حقيقية، بيتها حديقة خضراء غناء في كل الفصول، وعطرها رائحة الصابون والنظافة أينما وُجدت في الشعر أو الجلد أو في " الغسيل"، ومع أنها لا تحتمل الروائح الكريهة وتتأثر بها بشكل عكسي إلاّ أنها تفضل رائحة الأسماك على الشاطئ والحيوانات في الإسطبل وكل ما يتعلق بالطبيعة والأرض.';

        astrologyDiscribe +=
            'تواجه امرأة برج الثور ضعفا تجاه بعض الألوان وهذا أمر معروف ومألوف عليها، فهي لا تقاوم اللون الأزرق ومشتقاته، وكذلك اللون الوردي بكافة فروعه، وان أكثر ما يجذبها بالألوان احتوائها على انسجام وتوافق، و لا تغفر للرجل اذا كان جاهلا في هذه الأمور، لها ذوق رفيع في الطعام يُنم عن حسّها المُرهف بالأشياء، لا تعترف بالمعلبات والأطباق سريعة الإعداد، وإذا كنت محظوظا ودعوت إلى مائدتها قدمت لك أطيب الأصناف والأنواع وأكثرها ابتكارا، ان مهارتها وذوقها يذكرانا بالمثل القائل: " معدة الرجل أقصر طريق إلى قلبه".';

        astrologyDiscribe +=
            'امرأة فنانة، تحب الموسيقى وتعشق الرسم والغناء، تزور المعارض الكبيرة والمتاحف المميزة باستمرار، تهوى زيارة الطبيعية الجميلة، خاصة تلك التي نتعجب بها من عظمة الخالق كالشلالات العظيمة والجبال الشاهقة و البحيرات الشاسعة، تـحترف لغة الأصابع التي تتعرف من خلالها لجمال الأشياء، تـُفضل على غيرها القماش المصقول والصوف الناعم.';

        astrologyDiscribe +=
            'ام عظيمة تجيد التعامل أطفالها الصغار لكنها تواجه مشكلة في هذا عند وصولهم سن المراهقة، والسبب في ذلك غالبا تمسكها بنظامها الأول معهم كأطفال غير مدركة أنهم قد كبروا واجتازوا تلك المرحلة وأنه من الضروري ايجاد نظام جديد معهم بعيد عن فرض الأوامر الذي يواجه في أغلب الأحيان بالرفض والتحدي.';
        astrologyDiscribe +=
            'لعل من أكثر الأشياء التي ترفض امرأة الثور التنازل عنها الترتيب والنظافة على مدار 24 ساعة وفي كل الظروف ثم إنها امرأة جبارة لا تعرف التعب أو الشكوى، وإذا ما اضطربت أوضاع الأسرة اقتصاديا نزلت بهدوء وصمت وبدون تردد إلى ميدان العمل متقبلة ذلك برحابة صدر، كما وتتميز هذه المرأة بقوة البنيان وصلابة الإرادة وعلى الرغم من بطء حركتها وتفكيرها الا أنها انسانة دؤوبة، تصبرعلى الآلام النفسية والجسدية بشكل لا يُصدق، تنفذ جميع أعمالها وأقوالها بروح عملية رائعة.';

        astrologyDiscribe +=
            'يجد الرجل في امرأة برج الثور شريكة حياة حقيقية، لأنها صبورة على الشدائد ولا تتخلى عن تفكيرها الدائم بالتفاؤل والطموح، انها أيضا انسانة مثابرة لا يُضنيها تعب النهار أو سهر الليل، من أكثر النساء التي يمكن الاعتماد عليهن فهي كالساعة الدقيقة أوالة الحاسبة التي لا تعرف الخطأ، بيتها فسيح واسع كقلبها، دائما توفر فيها مكان للأقارب أوالأصدقاء والجيران، إنها باختصار المرأة الكفؤفي كل شيء';
      }
    } else if (month == 5 && day >= 22 || month == 6 && day <= 21) {
      astrology = "الجوزاء";
      type = 'الهوائي';
      color = 'الأخضر والأصفر';
      numbers = '5 - 7 - 14 - 23';
      if (male) {
        astrologyDiscribe =
            'ان من أبرز صفات رجل الجوزاء القلق وعدم ميله للارتباط، ومن المهم جدا أن لا تغيب هاتان الصفتان عن عقل المرأة التي تنوي الارتباط بهذا الرجل، وعليها أن تعلم أن الحب لديه شيء مختلف عن الشيء الذي يرغب به في مزاجه الخاص، هذه النظرية لوحدها كفيلة بهدم أكثر البيوت سعادة واستقرارا إلا إذا ضحت الزوجة وتحملت وأخلصت الى أقصى الحدود الممكنة، في هذه الحالة ستـنـقلب حياتها لنعيم دائم، لأن رجل الجوزاء يمتلك مزايا قليلة الوجود في الرجال الاخرين، يكفي أن الوقت معه يمر كلمح البصر، وأنه لا يعرف الرتابة والملل، وإذا نطق كلمة أحبك لزوجته، نطقها لعشرات الأسباب وبكل اللهجات، يدعوها الى المطاعم أو المسارح أو دور اللهو أو المتاحف أو حتى الشواطئ والجبال وأماكن أخرى كثيرة لا تخطر على بالها قط بطرق طريفة وجديدة، يتحدث معها في كل الأمور وعن كل المواضيع لأنه يعرف الكثير فهو انسان متطلع ومثقف يكاد لا يجهل شيئا ..من ناحية أخرى قد يخرج رجل الجوزاء من البيت بنية الرجوع بعد ساعة لكنه يقضي أياما خارجه ويبدو أحيانا مشغولا يفكر طيلة الوقت ونظراته تائهة لا وجود له بالبيت الا بجسده مما يجعل زوجته محتارة متسائلة تفكر بألف احتمال وتحسب لألف حساب.';
        astrologyDiscribe +=
            'رجل الجوزاء سواء كان حبيبا صديقا أو زوجا، يتميز بالذكاء والمرح والاثارة، لكنه سريع الضجر وشخصيته هوائية متقلبة، إذا أهمل أصدقائه ونسيهم فلا يكون السبب وراء ذلك قلة الوفاء لهم انما هناك تغيرات تطرأ على حياته ونفسيته فتجعله متعطشا لنمط حياة جديد، ولهذا السبب أيضا من الصعب عليه التعلق بماضيه سواء كان هذا الماضي عبارة عن ذكريات أو أماكن أو أشياء أخرى.';
        astrologyDiscribe +=
            'يكره هذا الرجل العزلة والوحدة لفترات طويلة، ويُفضل مخالطة مستويات مختلفة من البشر، إنه متحدث لبق ودقيق الملاحظة يضفي جوا من المرح والسرور على جلساته، ولو خُـيّر لاختار أن يتزوج أكثر من مرة، ولأن الأمر ليس بهذه السهولة يستعيض عنه بأشياء أخرى فيمثلك مثلا أزواجا من البيوت والسيارات والهوايات الخ، هذه الازدواجية تظهر كذلك في قضايا المال، فهو يبدو سخيا لأبعد الحدود تارة وبخيلا لدرجة الشح تارة أخرى.';
        astrologyDiscribe +=
            'رجل الجوزاء انسان محبوب من قبل الأطفال عامة ومن قبل أطفاله بشكل خاص، تربطه بهم علاقات قوية وحميمة تقوم على الثقة والصراحة وتبادل الآراء وكذلك المعلومات، ومن سيئاته القليلة كأب الفشل في فرض النظام واطلاق الكثير من الوعود التي يستصعب تحقيقها، وتسيء حدة لسانه لكرامة أطفاله في بعض الأحيان لكنه يملك طيبة قلب غالبا ما تغفر له أخطاءه.';
        astrologyDiscribe +=
            'انه رجل قليل الغيرة لابتعاده عن حب التملك، الحب في رأيه يتخطى مفهوم الارتباط الجسدي، إنه مشاركة روحية وعقلية وجسدية معاً، يمتلك جاذبية في المناسبات لا يمكن مقاومتها، يكره ملاحقة الفرص لكنه يقبلها بطيب خاطر ان أتت بدون عناد.';
        astrologyDiscribe +=
            'يقال أن الازدواجية لدى هذا الرجل قد تجعله يسعى لحبين في آن واحد، لكن لا يعني هذا بأنه يحن لامرأتين في وقت واحد، بالحقيقة ان أمره غير مفهوم ..من الصعب على أية حال أن يرضى الرجل الجوزاء بالمرأة قليلة الذكاء، ولن يذهب إلا لصاحبة الفطنة والحيلة والمرونة، ومن السهل على مثل هذه المرأة أن تفهم سر طبيعته و أن تظهر له على النحو الذي يحبه ويرضي ازدواجيته';
      } else {
        astrologyDiscribe =
            'حلوة رشيقة، ملفتـة للأنظار ومتبدلة، هذه المرأة وجدت لتعمل ولتـكون حاضرة، عمرها يلعب دورا كبيرا في حياتها فالجوزائية في سن المراهـقة هي غير الجوزائية في سن الشباب وفي سن الشباب غير السيدة في سن الكهولة، صاحبة شخصية مرحة وتشع بالحيوية، نادراً ما تجدها حزينة أو متطلبة، لها حضور يُدخل الفرح لقلوب الحاضرين وإن كان بشكل مؤقت.';
        astrologyDiscribe +=
            'الجوزائية متـقلبة، أنانية قليلا وحريصة كثيرا على أشيائها وممتـلكاتها، وهي أيضا اقتصادية إلى حد البخل في بعض الأحيان بالرغم من كونها انسانة مضيافة وتحرص على أن يكون بيتها مفتوحاً، لا ندري ان كان هذا كرماً ؟! ربما هو كرم مدروس بدقة، انها تستطيع القيام بأكثر من أمر سويا لأنها لا تعترف بالتعب وليست من ذاك النوع الذي يتأفف ويشتكي، في بداية سنوات الشباب تـكون انسانة رومانســـية حالمة لا تفارق الابتسامة شفتيها، لكن وبعد سنواتٍ قليلة تبدو كأنها إنسانة جديدة فتصبح واقعية أكثر، جديّـة، تحلل الأمور وتميل لتفسير الأشياء، إنها انسانة مرحة مسلية سريعة ودقيقة الملاحظة تحب حفظ الأشعار وقراءة الفلسفة والخوض في المواضيع السياسة، وهي بالإضافة لذلك ربة منزل ممتازة، وسيدة صالون من الدرجة الأولى، أعصابها غالباً متوترة وأما مخاوفها فكثيرة وكذلك هي هواياتها ومجالات ابداعها.';

        astrologyDiscribe +=
            'الجوزائية انسانة اجتماعية تعتـقد أحيانا أنها لن تـُغرم أبداً، لكن وفي حقيقة الأمر ان هذه المرأة حلوة المعشر عاطفية بشدة، ومتأججة المشاعر إذا ما التقت بالرجل الملائم المتحرر والمسؤول والذي يستطيع أن يُرضي عقلها وقلبها بالاضافة الى جسدها معاً، إذا أحبت قدمت الاخلاص والتضحية ووقفت بجانب حبـيـبها وقفة جدية جريئة ومسؤولة، انها تـشجعه وتمدُ له أيدي المساعدة دون أن تدعه يشعر وكأنه اتكالي، أكثر الجوزائيات المتزوجات سيدات بيت من الطراز الأول فالمرأة الجوزائية تحب الاهتمام في بيتها وتسعى لأن يبقى نظيفاً ولافتاً، فتضيف كل يوم لمسة جديدة عليه تذكرك من خلالها أن المرأة هي الأنوثة قبل أي شيء، من الأمور التي ترضى عنها لكنها تخشاها في الوقت نفسه الأمـومة، لكنها أم ممتازة في كل الأحوال تعامل أولادها كالأصدقاء ولا تقوم بفرض القيود والأنظمة الصارمة عليهم، وتـكون حازمة حيناً ومتساهلة أحيانا أخرى، وهي محظوظة لأنها قادرة على امتلاك مشاعر أولادها الذين تراهم جالسين قربها ناظرين إليها، مستمتعين بأحــاديــثـها، هذه المرأة لا تبخل بأن تمد يد المساعدة قدر ما استطاعت، عيبها هو قلة صبرها، لذلك عليها أن تعوّد نفسها على الاستـقرار كي لا تبقى دائمة الدوران في حلقة مفرغة، لكن مهما تكن سيئاتها فلها فضائل كثيرة انها امرأة مثيرة ومسلية، ومن يسكن معها لا يعرف الضجر فهي متـقلبة متبدلة، ومتجددة اليست أفضل من أن تـكون انسانة مستـقرة في شخصيتها وتقليدية في هواياتها ولا تشرق باشراقة جديدة كل يوم';
      }
    } else if (month == 6 && day >= 22 || month == 7 && day <= 22) {
      astrology = "السرطان";
      type = 'المائي';
      color = 'الأبيض';
      numbers = '2 - 3 - 15 - 20';
      if (male) {
        astrologyDiscribe =
            'التكتم كلمة مرادفة لرجل برج السرطان الذي يجهله أكثر الناس قربا منه، فإذا كانت ثـقته بالمقربين اليه على هذا الشكل فكيف هي اذن بالنسبة للغرباء ؟ على كل حال، يبقى تهذيب ولطف هذا الشخص كاملين لا يعتريهما أي نقص، وكذلك هو صدقه مع نفسه، فهذا الانسان لا يتغير ولا يتبدل مهما تغيرت الظروف والأحوال.';
        astrologyDiscribe +=
            'يتأرجح رجل برج السرطان بين التعمق والسطحية، وكذلك بين الثبات والتقلب، ويصاب في بعض الأحيان بنوبات أقرب ما تكون الى الجنون، وإذا خاف من فقدان شيء عزيز عليه أصبح انسانا لئيماً سيئ المزاج، تعامله مع الناس واحتكاكه فيهم يُولد لديهم شعورا غريبا يبدأ وكأنه بارد في المرة الأولى ليتحوّل بعدها إلى حرارة ودفء، شخص حريص على ماله فلا يُفرط في نقوده أبداً ويتظاهر بالحاجة وينجح بأدائه لهذا الدور إلى الحد الذي يدفع بعض الأشخاص لعرض المال عليه فهم لا يعرفون أنه يمتلك الكثير ويخزنها في البنوك، اقتصادي من الدرجة الأولى فهو يعرف جيدا متى ينفق وكيف ينفق وإذا أسرف مرة لسبب قاهر لا يُعيدها مهما حدث معه، الا أنه يزور المطاعم الفخمة لقناعته بأن ما يأكله فيها شيء يستحق أن يدفع المال عليه، ويرتدي أفخم الملابس بعد أن يقوم بشرائها في موسم التـنزيلات، ويقتـني العديد من الأشياء الثمينة التي تبقى طويلاً.';
        astrologyDiscribe +=
            'على زوجة هذا الرجل الشعور بالطمأنينة وعدم الخوف من حدوث أزمات مالية في المستقبل، فالمال متوفر، والتوفير مضمون، ولا يوجد أية ديون، لكن من الجائز أن تكون حزينة وتعيسه اذا كانت امرأة ذات طبيعة حساسة مع هذا الزوج الذي لا يفكر الا بتخزين الأموال وتكديسها، لكن وعلى أية حال عليها العلم بأن تجميع الثروة عند زوجها هو غاية لا وسيلة.';
        astrologyDiscribe +=
            'رجل السرطان انسان نظيف وأنيق ويفضل ارتداء الملابس الرسمية أو الكلاسيكية على غيرها، إذا قرر اقتناء سيارة اختار الأجود والأغلى ثمنا لعلمه أنها متينة وستبقى لديه فترة طويلة أكثر من غيرها، معطف زوجته مصنوع من الفراء الأصلي للسبب ذاته، يميل الى حب الفن وهذا أمر مستغرب عليه، ولكنه فنان ويحب على وجه الخصوص التصوير الفوتوغرافي والرسم، ولا يُستبعد عنه انتاج لوحات جيدة لاستعملها في التجارة والربح.';
        astrologyDiscribe +=
            'في الحب يكون رجل برج السرطان انسانا مترددا يفكر طويلا قبل الإقدام على الخطوة الأولى ليقينه أن المرأة التي تستحق أن ترتبط به نادرة الوجود،و قد يكون سببا من أسباب تردده تعلقه ببيت والديه وبأمه التي يقدرها ويحترمها بشكل كبير، إذا وجد المرأة التي يريدها تمسك بها بكل ما يملك من قوة وعاملها معاملة الأطفال،الا أنه يبقى مترددا في مصارحتها بحقيقة مشاعره بداية الأمر مُفضلاً أن تقوم هي بالخطوة الأولى، الثوب الأنيق الجذاب والعطر الذكي والجو الرومانسي الممتلأ بالموسيقى والأزهار هو أقوى سلاح قد تستخدمه محبوبته معه وهي وسائل كافية لسلب قلبه وعقله معا، لكن إذا أرادت الاستمرارية في هذه العلاقة عليها اجادة فن الإصغاء خاصة عندما يُحدثها عن نفسه كأصله وعائلته وماضيه، وبالأخص أمه التي تكاد تكون المنافسة الوحيدة لها في حبه.';
        astrologyDiscribe +=
            'رجل برج السرطان هو أب عطوف وصبور وحنون، يشرف بنفسه على رعاية أولاده وطعامهم ونومهم، وتأخذ بناته الجزء الأكبر من هذه الرعاية، وسواء أكانوا صبياناً أم بناتاً يكره جداً أن يستلقوا عنه عندما يكبروا';
      } else {
        astrologyDiscribe =
            'إن أي رجل يرتبط بالمرأة السرطان يقف ويسأل نفسه السؤال التالي : "من أية مخلوقات هي زوجتي ؟ هل من الحوريات الفاتنات، أم من الفراشات الطائرات، أم من المخلوقات الشرسة، أم هي مجرد امرأة مجنونة قليلا ؟ لا أحد يدري بالفعل ما هي؟! حتى امرأة برج السرطان نفسها تجهل حقيقة أمرها وتدرك بالفعل أنها ليست امراةعادية، حزنها يأتي ويذهب دون سبب واضح، وضحكها يغلب عادة على المشاعر الأخرى لديها، الا أنها تمتلك خيالا خصبا وتتميز بالطرافة في تصرفاتها';
        astrologyDiscribe +=
            'إذا قمنا بتحليل شخصيتها بالتفصيل وجدناها امرأة حريصة جدا الى درجة تخزين أشياء صغيرة ليس لها أي قيمة لكنها لازمتها منذ أيام الطفولة، مثال ذلك حافظة نقود مليئة بالقطع المعدنية المختلفة أو بعض الدمى والألعاب أو بعض الشرائط القديمة الملونة التي لا تستعمل أبداً، هل هناك أي تبرير لهذا التصرف غير كونها امرأة بخيلة؟ أو قد لا تكون بالفعل بخيلة ولكنها بالتأكيد امرأة لا تعرف معنى الاسراف، ومصروفها أقل من دخلها بكثير، إذا أنفقت قامت بذلك عن وعي وتخطيط مسبق ووفقا لالية واضحة، وإذا ظهر منها القليل من التبذير يكون في حالات نادرة والسبب في هذا على الأغلب مرورها بأزمة نفسية ترغب بتخطيها فتنتقم لنفسها منها بهذه الطريقة، أفكارها وأحاديثها تكون دائما عن المال، ومن الألفاظ التي تسحر بها البنك، الرصيد، الأسهم، الخ... الا أنه يجب عدم اساءة الظن بها بشكل كامل وعدم الاعتقاد بأنها لا تكون سعيدة الا بالمال، فهي تملك مزايا رفيعة جداً حتى في أمور المال، فمثلا إذا لم يستطع شريكها كسب المال الكثير وظل مكسبه دون المستوى الذي تريده سكتت ورضيت بالأمر الواقع لأنها تعلم جيدا أنه يسعى ويحاول بشكل جدي لكن الحظ لم يحالفه.';

        astrologyDiscribe +=
            'يعد الشاطئ هو الجو المفضل لهذه المرأة وهو مكان سعادتها وانطلاقها خاصة عند اكتمال البدر، لأنها تعيش حالة استرخاء تامة في هذه الحالة فيزداد ميلها للتخيل والمصارحة في الحب، والنساء المحبات من برج السرطان نوعان: النوع الأول خجول ومتردد، أما الثاني فصريح وإيجابي، لكن غالبيتهن يُفضلن قيام الرجل بالخطوة الأولى، وجميعهن لا يرغبن النقد والسخرية، وأتـفه الأسباب كفيل بجرح كرامتهن';

        astrologyDiscribe +=
            'حبها صادق وعميق، أما غيرتها فقليلة، إخلاصها عظيم، ويظهر لديها الحرص الشديد في التعامل مع زوجها، فهي تخاف خسارته لذلك نراها تتمسك فيه بكل ما لديها من قوة، مشاكلها العاطفية أساسها ضعفها الداخلي فهي تفتقد الثقة بالنفس، كثيراً ما تتساءل هل أنا جميلة وذكية بما يكفي ليحبني زوجي؟، ولهذا السبب تكون حساسة وتجرح بسهولة، ومتى جُرحت انطوت وتقوقعت على نفسها تماما كالسرطان الذي هو شعارها.';

        astrologyDiscribe +=
            'المرأة السرطان هي أم مثالية تمتلك حنانا وعطفا بشكل غير محدود، ترعى أولادها وتظهر اهتمامها بهم في جميع الأوقات وبكافة الظروف، فتـُشرف على ما يخصهم من مأكل وملبس وراحة وحتى نزهات، إذا مرضوا سهرت الى جانبهم الليالي، وإذا احتاجوا إلى أي شيء ضحّت وتعبت لتأمينه، لذلك ليس بالغريب تمسك أطفالها الشديد بها واعتبارها ملاذهم الوحيد، أما عيب هذه الأم هوالقيود التي تضعها على أولادها فتعطيهم الحرية بصعوبة كبيرة وبالغالب تقبل زواجهم مُكرهة.';
        astrologyDiscribe +=
            'من أهم المزايا التي تتمتع بها هذه المرأة هي الشجاعة والصبر والحرص وكذلك تقديس البيت والعائلة والزوج، ومن أكثر عاداتها طرافة سهولة الضحك والبكاء.';
      }
    } else if (month == 7 && day >= 23 || month == 8 && day <= 22) {
      astrology = "الاسد";
      type = 'الناري';
      color = 'الذهبي والأصفر والبرتقالي';
      numbers = '1 - 3 - 10 - 19';
      if (male) {
        astrologyDiscribe =
            'ليس بالخبز وحده يعيش رجل برج الأسد، هذه الحقيقة يجب ألا تغيب عن ذهن شريكة عمره إذا أرادت له حقاً حياة كريمة مملوءة بالسعادة والرضى، ولتعلم أن أهم العوامل التي يتغذى بها على الصعيدين النفسي والجسدي هي الحب والاحترام والثناء، ولتكن دائماً على حذر من مظهره الوديع لأن وراءه روحاً أبيّة لا تـُمَس، وإذا مُسّت ردّ بعنف وتحدّ غير متوقعين.';
        astrologyDiscribe +=
            'رجل برج الأسد مع المرأة خلوق عاطفي ومتسلط في آن واحد، يتمتالرجل الأسد:';
        astrologyDiscribe +=
            'لا يمكن لرجل برج الأسد العيش بالخبز وحده، وهذه الأمر يجب أن يبقى في ذهن شريكة الرجل الأسد إذا أرادت له بالفعل حياة كريمة مليئة بالسعادة والرضى، وعليها العلم بأن الحب والاحترام وكذلك الثناء هم الغذاء الجسدي والروحي لهذا الانسان، وعليها الحذر من مظهره الوديع الهادئ لأن وراءه شخصية قوية لا يمكن المساس بها، وإذا مُسّت كان رده عنيفا ومتحديا بصورة غير متوقعة.';
        astrologyDiscribe +=
            'انه خلوق وعاطفي مع المرأة الا أنه يملك شخصية متسلطة .. يتمتع بطاقة حب كبيرة جدا وقابلة للانفجار عند أول إشارة، وان لم يتمكن من التنفيس عنها ذبل وظهر و كأنه يعيش في مأساة حقيقية.';
        astrologyDiscribe +=
            'وإذا حالفه الحظ والتقى بالشريكة المثالية انقلب إلى بركان حقيقي يطلق حمم العشق والإعجاب والبذخ، فتراه يتعامل مع محبوبته بوسائل ملتهبة، ودعوات متتالية، وهدايا فاخرة، والكثير المغريات الأخرى التي يستحيل مقاومتها، لذلك لا بد للانسانة التي تحصل على هذا الحب العظيم والاهتمام الكبير تقديم المقابل الا أن هذا المقابل هو التضحية بجزء من حريتها وأعصابها في بعض الأحيان، ذلك لأن الرجل الأسد كالسجّان وإن كان سجنه هذا من الذهب، وهذا كله بسبب غيرته الشديدة على محبوبته من جميع الرجال، وتراه يتدخل في شؤونها سواء كانت كبيرة أم صغيرة، ولا يتردد في استخدام العنف إذا شك بسلوكها أو إخلاصها له .. بالنسبة لزوجة هذا الرجل عليها اظهار الطاعة له، وابداء إعجابها به، واغماض عينيها عن حبه للعظمة الذي يبدو واضحا جدا في شخصيته، ومحاولة مواجهة حماسه واندفاعه باستخدام الرزانة والتعقل.';
        astrologyDiscribe +=
            'من أكثر الأمور التي يرفضها هذا الرجل وبإصرار عمل زوجته في الخارج، ولعله يخشى منافستها له على هذا الصعيد، الا أنه لا يتردد في تقديمها لأصدقائه وهي بأجمل صورها ليتفاخر بها أمامهم، وتتصف معاملته لهاً بالاحترام والكرم والحماية دائما .. لديهما حياة اجتماعية مليئة وإن كان يقوم بممارسة حياة العزوبية من فترة لأخرى فمثلا يخرج مع أصحابه إلى مقهى أو مطعم أو في رحلة مثلا، ان مشكلته الأساسية هي المقامرة وحب المغامرة بالمال، لذلك على زوجته بذل ما في وسعها لابقاءه بعيداً عن المزايدات والمقامرة والبورصة وأي شيء يشكل خطراً على وضعه المالي، وليس التبذير فقط هوايته، فهو أيضا يعشق العمل الميكانيكي ويفهم للآليات والمحركات، ولا يستعصي عليه المجال الكهربائي وكذلك النجارة ومشتـقاتها، انه أيضا يحب البناء، وقد يتمكن من أن يبني غرفة إضافية في بيته أو يصنع بيديه مفروشات البيت.';
        astrologyDiscribe +=
            'يُعتبر رجل برج الأسد في الاحتفالات والمناسبات مصدرا للتسلية والمرح، الا أن هذا الأمر لا يمنعه من المحافظة على كرامته وقدره بالشكل الملائم، وبما أنه يعشق الجمال ويُقدره بشكل كبير قد يبدو في بعض الأحيان منشغلا عن زوجته بتأمله الوجوه الحسنة، لكن بنية غير سيئة لا يقصد بها الخيانة، على كل حال يملك هذا الرجل ابتسامة مشرقة وقلب طيب كفيلان بمحو أخطاءه سواء مع زوجته أو مع الآخرين، وكثيراً ما يختار رجل الأسد زوجة دون مستواه كي يبقى محتفظاً بدور السيد بشكل كامل، وإذا فشل بالاختيار وشعر بأن زوجته تنافسه في السلطة أصبح تعيساً مُعكر المزاج، ومن المعروف عنه عدم حبه لانجاب الكثير من الأولاد على الرغم من كونه أب عطوف محب لأبنائه ومهتم لرعايتهم.';
        astrologyDiscribe +=
            'شخصية هذا الشخص إجمالاً مُحيّرة، وكل من يتعامل معه يجد نفسه أمام سلسلة كبيرة من التساؤلات: "هل هذا الانسان حقاً معطاء أم هو رجل أناني يحب نفسه فقط؟ هل يمتلك صفات الزعامة أم أنه يتظاهر بامتلاكها؟ هل هو شخص اجتماعي كما يدّعي؟".. هناك شيء لدى الرجل الأسد ولا يمكن لأي انسان انكاره انها كفاءته بالحب والعمل.';
        astrologyDiscribe +=
            'عقدة رجل الأسد هي الخوف من أمرين وهما الفشل وسخرية الناس، وفيما لو لقي التشجيع الضروري أصبح لا يخشى شيئا، العيش لجانبه متعة حقيقية إذا تمكنت المرأة من نسيان ذاتها واحترامه معا.';
        astrologyDiscribe +=
            'ع بطاقة حب عظيمة قابلة للتفجر عند أول إشارة، إذا لم يستطع التنفيس عنها ذبل وأوحى بأنه يعيش مأساة حقيقية.';
        astrologyDiscribe +=
            'وإذا أسعفه الحظ ولقي رفيقته المثالية انقلب إلى بركان حيّ يطلق حمم الغرام والإعجاب والبذخ، وسائله مع الحبيبة وسائل ملتهبة، ودعوات متلاحقة، وهدايا فاخرة، وغير ذلك من المغريات التي يصعب بل يستحيل مقاومتها، مقابل ذلك لا بد للمرأة التي تحصل على مثل هذا الحب العظيم من أن تدفع ثمنه من حريتها وأعصابها أحياناً، ذلك بأن رجل برج الأسد أشبه بالسجّان وإن كان سجنه من ذهب، إنه يغار على حبيبته من جميع الرجال، ويتدخل في شؤونها الكبيرة والصغيرة، ولا يتردد في إظهار العنف إذا راوده الشك في سلوكها وإخلاصها، بالنسبة إلى زوجة هذا الرجل عليها أن تـُظهر له الطاعة، وأن تـُبدي إعجابها به، وأن تـُغمض عينيها عن مركب العظمة الذي يبدو فيه بوضوح، وأن تـُواجه حماسه واندفاعه بالرزانة والتعقل.';
        astrologyDiscribe +=
            'من الأمور التي يرفضها رجل برج الأسد بإصرار عمل الزوجة في الخارج، ولعل سبب ذلك خشيته المنافسة، بالمقابل لا يتردد في إظهارها أمام الأصدقاء وهي على أتم هندام وزينة مما يُشعره بالسعادة والفخر، إلى جانب ذلك تـتسم معاملته لها دائما ً بالنبل والكرم والحماية، حياتهما الاجتماعية ملآنة وإن كان يمارس حياة العزوبية بين الفينة والأخرى فيخرج عندئذٍ مع الأصحاب إلى مقهى أو مطعم أو غيره، مشكلته الأساسية المقامرة والمغامرة بالمال، وعلى زوجته أن تعمل ما في وسعها ليبقى بعيداً عن المزايدات والبورصة وكل ما يشكل خطراً على أوضاعه الاقتصادية، ليس التبذير هوايته الوحيدة لحسن الحظ فهو ميكانيكي من الطراز الأول يفهم الآليات والمحركات وغير ذلك، حقل الكهرباء لا يُستعصى عليه وكذلك النجارة ومشتـقاتها، حتى البناء، وقد يصل به الأمر إلى حد صنع مفروشات البيت أو بناء غرفة إضافية.';
        astrologyDiscribe +=
            'في الحفلات يُعتبر عنصر تسلية ومرح، لكن الهزاز لا يُفقده شيئاً من كرامته وقدره، وبما أنه يُحب الجمال ويُقدره حق قدره يبدو أحياناً مشغولاً عن زوجته بتأمل الوجوه الحسنة، لكن تصرفه هذا يخلو من سوء النية ولا يُشكل سبباً للغيرة، على كل حال ابتسامته المشرقة وقلبه الطيب كفيلان بمحو هفواته سواء عند زوجته أو عند الآخرين، وكثيراً ما يتزوج من امرأة دونه مستوى كي يظل محتفظاً بدور السيد المطلق، وإذا أساء الاختيار وشعر أن زوجته تنافسه في العرش بدا تعيساً مُعكر المزاج، من الطريف أن لا ينجب رجل برج الأسد العديد من الأولاد مع أنه والد عطوف كثير الرعاية لأبنائه.';
        astrologyDiscribe +=
            'شخصية هذا الإنسان إجمالاً مُحيّرة، فجميع الذين يتعاملون معه يجدون أنفسهم أمام سلسلة من التساؤلات: "هل هو حقاً معطاء أم أنه رجل أناني لا يُحب سوى نفسه ؟ هل عنده صفات الزعامة أم يتظاهر بأنه يملكها ؟ هل هو اجتماعي كما يدّعي؟". شيء واحد على الأقل موجود عنده ولا يستطيع أحد إنكاره وهو كفاءته في الحب والأعمال.';
        astrologyDiscribe +=
            'أخيراً عقدة رجل برج الأسد الخوف... الخوف من الفشل ومن سخرية الناس، إذا لقي التشجيع اللازم عاد لا يرهب شيئاً، العيش إلى جانبه متعة إذا تمكنت المرأة من إنكار ذاتها واحترامه في آن واحد';
      } else {
        astrologyDiscribe =
            'شبه امرأة برج الأسد وردة دوار الشمس وذلك لأنها كيفما اتجهت لحقتها أنظار من حولها خاصة أنظار الرجال، لكن هل تستحق هذه المرأة هذا القدر من الاهتمام؟ الجواب هو نعم متى علمنا أن الله رزقها الكثير من الحيوية والجمال والذكاء والجاذبية الجنسية، لذلك هي تعد المرأة المثالية للرجل صاحب الشخصية القوية الواثقة، أما من هم عكس ذلك فوجود هذه المرأة في حياتهم يشعرهم بالنقص مما ينغص عيشهم.';
        astrologyDiscribe +=
            'إنها انسانة عاطفية لأقصى الدرجات، أي لدرجة الاحتفاظ ولو قليلاً بصورة لأصدقاء الماضي بالرغم من عدم رضى زوجها الذي تحبه ولا تـفضل عليه أي انسان، تبدو في أكثر الأحيان امرأة دمثة رقيقة الصوت ووديعة المظهر، الا أنها سرعان ما تـنـقلب الى عكس ذلك مجرد وقوع زوجها في هفوة، إنها تعترف بإحساسها المرهف، وكثيراً ما تنبه الآخرين من الوقوع في سوء المعاملة معها، هي في ذلك كاللبؤة التي تشحذ مخالبها بشكل يومي منتظرة الساعة المناسبة لتنقض على فريستها.';

        astrologyDiscribe +=
            'نصيحة للرجل الذي يفكر بالارتباط بامرأة من برج الأسد : إذا كنت شخصا يحمل اسما عاديا ولا يعكس نبلا، أو كنت تـفـتـقر للرجولة الكاملة، أو لست سخي بالقدر الكافي، فمن الأفضل بالنسبة لك الابتعاد عن طريقها، لكن اذا ما كنت ترغب بامتلاكها وتصر على ذلك عليك أن توجه لها المديح والثـناء بشكل دائم، وأن تهديها أفخر الهدايا، وهي لا تهتم للكمية بقدر اهتمامها للنوعية، وعليك الظهور أمامها بالمظهر اللائق والأنيق، فهي تكره الإهمال وتعده إهانة لها كما تكره الفقر لدرجة الشعور بالمرض.';

        astrologyDiscribe +=
            'ولدت المرأة الأسد لتكون مسؤولة وقائدة اجتماعية تتولى توزيع المسؤوليات والمهمات وتسن الأنظمة والقوانين، لكن وعلى الرغم من امتلاكها مشاعر دافئة وابتسامة مشرقة تخفي في داخلها الكبرياء والتعالي، ومصدر ذلك إيمانها الكبير جدا بأنها أفضل من الجميع على الإطلاق، والجميل أن هذا الاعاتقاد لا يجلب لها النقمة أو حتى الكراهية وذلك لأنها تمتلك طيبة وكرم كبيرين وتكون السباقة دائما لرعاية المحتاجين والأطفال خاصة.';

        astrologyDiscribe +=
            'إن أقصر وأسرع الطرق التي تؤدي للوصول الى قلبها الإطراء والمديح، وهي تستحق ذلك على أية حال من أجل لباسها وأناقتها وتجميل بيتها وتنسيقه والكثير من الميزات الأخرى، والجدير بالذكر أنها تـُفضل ارتداء الملابس الكلاسيكية والرياضية على الملابس الأخرى، وتختار أثمن الأقمشة وأجود الأنواع، وهي ربة منزل ممتازة ومضيفة رائعة تعرف كيف تقوم بالاشراف على راحة مدعويها، انها أيضا أم مثالية تمدح حسنات أطفالها دون أن تغض النظر عن سيئاتهم.';
        astrologyDiscribe +=
            'هي زوجة مخلصة لزوجها طالما كان مخلصاً لها، وان اهتمام الرجال بها لا يزعجها أبداً بل انها تعده دليلا على أنوثتها وجاذبيتها، ومع هذا تبقى انسانة متحفظة متعالية عن الآخرين وتطلب من زوجها الحذو على هذا الطريق كأن لا يرفع الحواجز مع موظفيه أو مع سكرتيرته الخاصة.';
        astrologyDiscribe +=
            'وامرأة الأسد تفضل بطبيعتها العمل خارج البيت، وترفض العيش وراء الجدران حتى لو كانت من ذهب، وان لم تشغل حياتها بالعمل استعاضت عن ذلك بالتبذير وبالحياة الاجتماعية المليئة بالحركة.';
        astrologyDiscribe +=
            'وأخيراً انها من المحتمل أن تخنق زوجها بما تمتلكه من شخصية قوية وفذة، لذلك عليه تدارك الأمر بالذكاء والرجولة اللازمتين لمثل هذا الوضع الصعب، لكن من العبث محاولة حجبها بدوره لأنها لن تسامحه على ذلك أبدا، وتعد مجرد قبولها به زوجا ورفيقاً لهو فضلا ً عظيماً إن لم تعتبره تنازلا';
      }
    } else if (month == 8 && day >= 23 || month == 9 && day <= 22) {
      astrology = "العذراء";
      type = 'الترابي';
      color = 'الرمادي والبيج والأصفر الباهت';
      numbers = '5 - 14 - 15 - 23 - 32';
      if (male) {
        astrologyDiscribe =
            'لم يُخلق هذا الرجل للمرأة العاطفية المتعطشة للحب ولعبارات الوجد والهيام، وإذا وقعت امرأة كهذه في حب رجل العذراء فستتحول نارها الى صقيع يوما ما بسبب برودة ملامحه، ونظرته المادية، وأفكاره البعيدة عن الخيال والأحلام، لكن واقعيته تتمحور بالغالب حول حياته الفكرية وليس من المستحيل أن يعيش علاقة حب طبيعية فمن الممكن جدا أن يدخل في علاقة ويحب ويعشق كأي رجل طبيعي، لكنه حتى وان أحب لا يصل الى القمة في هذا الحب فلن يشبه قيس وليلى أو روميو وجولييت، فهو يجهل فن البكاء والشوق واللوعة، ويفضل وسائل التعبير العملية أكثر كحسن المعاملة والاحترام والرعاية والإخلاص.';
        astrologyDiscribe +=
            'يظهر هذا الرجل للوهلة الأولى كأنه مصنوع من الفولاذ والثلج معا، ومع ذلك يوجد وسائل تمكن المرأة من غزو قلبه المحصن، إلا أنها بعيدة عن الغنج والملاحقة والرجاء والإصرار وعن كافة الطرق الأخرى التي قد تسلكها المرأة عادة لتصل الى من تحب، الرجل العذراء انسان يهتم بنوع الحب وليس بكميته، لذلك من الصعب أن يقع فيه، وإذا وقع بشكل جاد سرعان ما اكتشف أن حظه عاثر في هذا المجال، فيحاول نسيان عذابه في عمله، ويبتعد عن الناس، ويُضاعف من اجراءات الحيطة والحذر حتى لا يقع في حب أخر.';
        astrologyDiscribe +=
            'المرأة مع هذا الشخص يجب أن تتحلى بالصبر، والتأني، والحذر، هذا من جانب، ومن جانب اخر عليها أن تعرف بأن الطهارة أمر مقدس لديه، وأن حياة العزوبية التي يعيشها ليست صعبة عليه كما تعتقد، فإذا واجهته بعض العراقيل في زواجه ليس لديه أية مشكلة في أن يلغي فكرة الزواج ويبقى عازبا، وهو مقتنع وراضي بذلك .. يتمتع هذا الرجل بسحر كبير لا يوصف، ولا يعلم أحد بالضبط ما سر انجذاب الاخرين نحوه، ولماذا أكثر القلوب حصانة تهوي أمام جاذبيته الشديدة، يتميز بامتلاكه للفكر الحاد والمادة الصلبة، وهو انسان متواضع يحب التحليل والاختبار، من الصعب عليه إقامة العلاقات الجسدية البحتة، فهو يترفع حتى عن القضايا الجنسية، والحب لديه أقرب للطهارة والبراءة منه للشهوة، وبسبب ميله للانتقاد يستهلك رجل العذراء فترة طويلة في البحث عن الشريكة المناسبة له، وبكلام آخر من الصعب تحريك هذا الإنسان عاطفيا إن لم يكن أمرا مستحيلا ،، خاصة أنه يحب العيش وحيدا، ويستطيع البقاء هكذا طوال حياته من دون الشعور بأي نوع من الحنين للزوجة أو الشريكة.';
        astrologyDiscribe +=
            'بعض رجال برج العذراء يمارسون العلاقات الجنسية الصرفة لارضاء فضولهم فقط، وليُثبتوا لأنفسهم أن رجولتهم كاملة، وبمجرد اثبات ذلك يلغوا تلك العلاقات من حياتهم ويذهبوا للاهتمام بما هو أسمى وأهم بنظرهم، ولكن اذا دخل العذراء حبا حقيقيا كان صادقا ووفيا، ومن الايجابيات التي تعرف عنه في الزواج ميله للاهتمام بأبسط الأمور لارضاء زوجته، وبذل كل ما بوسعه لإزالة كافة العقبات من طريقها، ويهتم العذراء كثيرا في المحافظة على الروابط العائلية طالما لا يوجد سبب وجيه يدعو إلى عكس ذلك، وبالرغم من أن غيرته ليست شديدة، لكن العزة والكرامة قد تقوده أحياناً إلى الطلاق.';
        astrologyDiscribe +=
            'يُفضل الرجل العذراء الزوجة التي تهتم ببيتها ومطبخها وتعتني بنظافة أولادها، ولا يهتم كثيرا لأن يُرزق بأطفال، لكن إذا رزق بهم أحسن رعايتهم واهتم لتربيتهم ونمى فيهم الخلق الرفيع، وأوجد لديهم الفكر السامي وعزز المواطنة الصحيحة .. هم يتعلمون منه حب الثـقافة والعلم واحترام الفكر والآداب، لكن هناك قلق من قيام حاجز من البرودة والجفاء بين هذا الأب وأبنائه مع مرور الوقت، وليس لأي سبب واضح سوى خوفه وتردده من اظهار الحب والحنان لهم.';
        astrologyDiscribe +=
            'مهما يحمل هذا الرجل من عيوب يبقى لديه من الحسنات والقيم والأخلاق ما يكفي لكي تشعر كل نساء العالم بالغيرة من الزوجة التي اختارها بفكره وقلبه';
      } else {
        astrologyDiscribe =
            'يُخطئ من يظن أن هذه المرأة تمثل الضعف والطهارة بشكل دائم، يجب أن لا ننسى وقبل أي شيء أنها امرأة، أي أن فطرتها تحمل الكثير من التناقضات كالضعف والقوة وكالحسنات والعيوب بالرغم من المعاني الرفيعة التي يحملها رمزها "العذرية"، ان امرأة العذراء وعلى الرغم من فطرتها العذبة ساعية وراء تحقيق أهدافها والتمسك بسعادتها وعدم التفريط بحقها في الحياة التي ترغبها، حتى لو اضطرت لترك بيتها وزوجها وأبنائها، وإن ما يدفعها لمثل هذه المواقف المتطرفة هي قناعتها وايمانها بالصدق وبغضها الشديد للكذب، هي من فئة النساء المهمة في المجتمع وكل تصرف تقوم به بتحريض من قلبها ولا يقبل به مجتمعها يشعرها بالخجل والحزن، وبالرغم من ذلك تأبى أن تتراجع عن قرارها الذي تؤمن بأنه الحق.';
        astrologyDiscribe +=
            'المرأة العذراء انسانة عاطفية وواقعية في الوقت نفسه، تسعى لتحقيق الكمال في كافة أعمالها، بالرغم مما تحمله من بعض الصفات السلبية كظنها مثلا بأنها أكثر النساء كفاءة وامكانية وأقدرهن على التـنظيم، وايمانها بعبث كل حوار يديره الآخرون معها لقناعتها بقراراتها وآرائها وتمسكها بهم، ويمكننا القول انه ليس من الممكن أن تعترف هذه المرأة بخطأها، بالرغم من امتلاكها مهارة خاصة تستطيع من خلالها التفريق بين الصدق والكذب، عنادها لا يمكن مجاراته مع أنها تبدو في الأوقات العادية طيبة وحسنة الخلق لأبعد الحدود.';

        astrologyDiscribe +=
            'امرأة برج العذراء تتمتع كذلك بصفاء الفكر وبياض السريرة، هي ليست ساذجة كما يعتقدها البعض، انها بعيدة كل البعد عن السذاجة، ولا يمكن لأحد جرها إلى شرك الحديث المنمق والمعسول، ويتحدث الكثيرون عن تهذيبها وخلقها الفطري .. تتسم كل تصرفاتها بالنبل والتواضع بالرغم من اعجابها وثقتها الكبيرة بنفسها، وبالواقع يحق لها الاعجاب بنفسها لأنها جميلة المظهر، ذكية الملامح، طيبة الخاطر، تحمل ضحكتها جرسا موسيقيا عذبا، وتخبىء في عينيها صفاءً عجيبا، يداها ماهرتان وتـتـقنان الكثير من الأعمال وخصوصاً الأعمال الزراعية وأهمها زراعة الأزهار، والبيتية بالذات صنع العجين وخبزه في البيت.';

        astrologyDiscribe +=
            'تهوى المطالعة والموسيقى والمسرح وتعشق المهرجانات الفنية بكل أشكالها، وهي في كل هذه الميادين امرأة دقيقة الملاحظة، ذكية، وسريعة البديهة تقول رأيها بموضوعية تامة، وتوجه نقدها بطريقة سلسة عميقة، تكره لعب القمار والسبق، وكافة الألعاب التي تحتوي على عنصر المغامرة والتبذير.';

        astrologyDiscribe +=
            'يمكنها أن تكون شريكة مثالية تقاسم رجلها همومه وتزيح عنه متاعبه، فلا يشعر بالقلق أوالتوتر اللذين يصاب بهما عادة صاحب المسؤوليات الكثيرة والأحمال الثـقيلة، في الحقيقة ان ما تملكه من شجاعة نادرة وقدرة عظيمة على مواجهة المسؤوليات يمثل عونا كبيرا لزوجها، هذا بالإضافة لوفائها الذي لا يمكن أن يتزعزع، إلا عند حدوث أسباب قاهرة وصعبة خارجة عن سيطرتها، واذا خرجت عن الطريق الصحيح لا تلبث أن ترجع إليه تائبة ومستغفرة، وإن لم تعد كان معنى هذا أنها اختارت طريقاً اخر يؤمن لها الصراحة والصدق مع نفسها ومع الآخرين.';
        astrologyDiscribe +=
            'وفي الأمومة تمتلك هذه المرأة مواهب كثيرة، من أهمها اللطف، والحزم، واعطاء اهتمام كبير للقواعد الغذائية والصحية الصحيحة، والمبادئ الخلقية الرفيعة، يلجأ اليها أبنائها في الأوقات العسيرة، ويستمدون من نقائها وابتسامتها الشجاعة والتفاؤل.';

        astrologyDiscribe +=
            'يُقال أن لهذه المرأة فضل عظيم على زوجها في ثلاثة جوانب على الأقل : أولا تصون ماله ورزقه، وثانيا تهتم بالمحافظة على أسراره، وثالثاً تدير له أعماله، ولو رغبنا بإضافة جانب رابع لقلنا أنها تمتلك ابتسامة كفيلة بأن تـنسيه همومه وأحزانه';
      }
    } else if (month == 9 && day >= 23 || month == 10 && day <= 22) {
      astrology = "الميزان";
      type = 'الهوائي';
      color = 'الوردي والأخضر';
      numbers = '4 - 6 - 13 - 15 - 24';
      if (male) {
        astrologyDiscribe =
            'لا شك أنه أكرم الناس في توزيع النصائح بلا مقابل، عنده الجواب الشافي لكل سؤال وقضية وإن كان صعباً عليه الوقوف موقف المحايد بصورة مستمرة، فحبه للجدل واستناده إلى المنطق والتحليل يدفعانه إلى المجاهرة بآرائه الخاصة بأسلوب فذ يقنع الآخرين على الرغم منهم في كثير من الأحيان، سحره عظيم إلى الدرجة التي يستحيل معها التحرر منه، ابتسامته ولطفه كثيراً ما يمحوان سيئاته عند من يحب فلا ينسى الإساءة وحسب بل تلازمه الابتسامة أيضاً مثل ظله وتعمل المستحيل كي يهنأ ويسعد.';
        astrologyDiscribe +=
            'الحب مع هذا الإنسان عملية صعبة يتخلـّلها صعود وهبوط على الرغم من تأثيرات كوكب الزهرة ( فينوس) في سير حياته، لا شك أن سبب تلك الصعوبة يعود إلى عادة التـفكير والتمحيص عنده، وهو لا يكتـفي بإطالة فترة الدرس وحسب بل يتورع أيضاً عن الرجوع عن قراراته في اللحظة نفسها التي يشعر فيها بأنه غير مقتـنع تماماً، مما يدفع الكثيرين إلى اعتـقاد أنه لئيم الطبع بارد الشعور غير أهل للثقة، غير أن الواقع عكس ذلك تماماً، إن طبيعة رجل برج الميزان والعاطفة مترادفان على الرغم من كل التناقضات التي عُرفت عنه وهو يمارس الحب وحسب بل عرف كيف يصقله وكيف يجعله أرقى منه في جميع الأبراج الأخرى.';
        astrologyDiscribe +=
            'من الصعب أن يفشل هذا الإنسان في محاولاته مع الحبيبة، لكن الطريف في الأمر هو أنه حالما ينجح في مهمته يأخذ في إظهار التردد والتساؤل عن جدوى الاستمرار، ذلك التردد الذي يكاد يشبه الخوف لا يفقده على كل حال اهتمامه بالجنس الآخر حتى في مرحلة الشيخوخة، وقد يكون أحد أسباب تعلـّق النساء به أسلوبه القائم على المناورة وعدم الرفض من البداية، لكنه " تكتيك " معقد يُعذب المرأة أكثر من الرفض دون ريب، إذا نظرنا إلى رجل الميزان في مرحلة الشباب وجدناه هوائياً متقلب المزاج غالباً ما يخلط بين الصداقة والحب، وهو إذا شاء لنفسه النسيان والسلوى استطاعهما دون كبير عناء أو ندم، لكن ألمه الحقيقي أعظم منه عند الآخرين، ولا نكون مبالغين إذا قلنا أنه في مرحلة العذاب ينهار ويتحوّل إلى حطام.';
        astrologyDiscribe +=
            'فضول الرجل في برج الميزان محدود، وهو إذا ناقش فعل ذلك بطريقة مجردة بغية الوصول إلى النظريات الصحيحة لا أكثر، أي أن اهتمامه بالنظريات يفوق اهتمامه بالإنسان نفسه، إن قابليته لدرس الحقائق دون الدوافع تضعه في مصاف القضاة لا الأطباء النفسييـن، تلك هي على كل حال مشكلته الأساسية مع شريكة حياته التي يجهل كوامنها النفسية على الرغم من وضوح الرؤية ومهارة الاستنتاج المعروفين عنه، مقابل ذلك لا يعلو شيء على مكانة الزوجة عنده، وهي، أي الزوجة، تأتي قبل أولاده الذين يعزهم من كل قلبه، وبهذه المناسبة نقول أن دوره كأب يتسم بطابع الحكم والمرشد، فهو يحمي أبناءه الصغار من تعسف أخوتهم الكبار، ويعطي هؤلاء ما يستحقونه من الحرية والاستقلال دون أن يتأثر بمن هم أصغر سناً، بفضله يسود الهدوء والنظام في البيت في معظم الأحيان، وإذا حدث من أولاده أمر يستحق العقاب قام بالواجب دون تردد ودون أن يتخلـّى قيد شعرة عن أسلوب المنطق الذي يتمسّك به في جميع أقواله وأعماله.';
        astrologyDiscribe +=
            'الرجل في برج الميزان ميسور الحال إجمالا ً على الرغم من كثرة إنفاقه على الأشخاص والأشياء التي تعتبر مصدر الجمال والسعادة، وهو يستضيف الناس بكثرة، ومع ذلك يكره الاختلاط بالغرباء والجموع الغفيرة كما يكره الأماكن المغلقة والضجيج والفوضى، ثم إنه يهوى التنسيق والترتيب والنظافة والهدوء والأماكن الفسيحة والهواء المنعش ولهذا السبب يبدو بيته أشبه شيء بالواحة وسط ضجيج وغبار ولهاث العالم الخارجي.';
        astrologyDiscribe +=
            'أخيراً لا بد من كلمة إلى المرأة التي تقع في حب رجل الميزان : لا تيأسي من تردده وحذره، كوني إيجابية واخطي الخطوة الأولى فهو يستحق منك المبادرة';
      } else {
        astrologyDiscribe =
            'يُقال أن في كل رجل شيئاً من الأنوثة مهما كان بسيطاً، كما أن في كل امرأة شيئاً من الرجولة مهما كان بسيطاً، وهذا صحيح من الوجهة العلمية وإن لم نكن في صدده الآن، نظرة إلى المرأة في برج الميزان ترينا إياها مرتدية زي الرجل بالبساطة نفسها التي ترتدي بها ثياب الحرير، وتبدو في الزييـن بمنتهى الرقة والعذوبة والأناقة، وإذا أمعنا النظر قليلا ً وجدنا أن وراء الثوب، أو البنطلون لا فرق، عقلا ً واعياً وإرادة صلبة وتفكيراً منطقياً يعمل بمبدأ الرجال، وبكلام آخر نقول أن المرأة التي تنتمي إلى برج الميزان يجب أن لا نحكم عليها من خلال غمّازتيها وابتسامتها العذبة فقط.';
        astrologyDiscribe +=
            'لا نبالغ إذا قلنا أنها أول من أوجد "المونولوج" أي الحديث من جانب واحد، لكن ذلك لا يعني أنها مجرد امرأة ثرثارة، فهي تزن في الواقع كل كلمة ورأي بُغية الوصول إلى أصدق النتائج وأكثرها موضوعية، وبما أن عندها من الرقة قسطاً وفيراً نجدها تصدر آراءها ومعتـقداتها بطريقة دبلوماسية لا تتوفر لزميلها رجل الميزان، لا يمنعها هذا من الابتعاد عن أساس المواضيع والقضايا التي تعالجها في بعض الأحيان، الأمر الذي يُسبب للآخرين الضيق والانزعاج دون أن يفقدها شيئاً من سحرها وجاذبيتها.';

        astrologyDiscribe +=
            'تحب هذه المرأة العمل خارج البيت قبل الزواج وبعده، وهي تهدف من وراء عملها إلى المال الذي تعتبره بطاقة دخول للآخرين الضيق والانزعاج دون أن يفقدها شيئاً من سحرها وجاذبيتها.';

        astrologyDiscribe +=
            'تحب هذه المرأة العمل خارج البيت قبل الزواج وبعده، وهي تهدف من وراء عملها إلى المال الذي تعتبره بطاقة دخول إلى عالم الجمال والذوق الرفيع، وإذا فكـّرت في المال أيضاً فمن أجل زوجها الذي تعزه وتحترمه أكثر من أي انسان آخر، ويعتبر الزواج في رأيها شركة مساهمة بين اثنين مع ضرورة وجود أحدهما، تختار نفسها عادة، على رأسها، وهي باختيارها الدور الأول تسعى قبل كل شيء لخدمة زوجها، فتمهد أمامه الطريق وتدرس جميع الإمكانات والسُبُل التي من شأنها أن توصله إلى حيث يبغي، كل ذلك دون تذمّر من ناحيتها، أو شعور بالحرج من ناحيته، المشاركة على كل حال في طبعها، والانفراد بالرأي أو العمل خطأ تحاول تلافيه قدر المُستطاع.';

        astrologyDiscribe +=
            'بيتها يبدو كالتحفة الفنية أو كالإعلان في مجلة أنيقة ذات مستوى عال، تهوى جمع الأدوات الفضية والأطباق الثمينة والمفارش الأنيقة والشمعدانات وغير ذلك، طعامها سواء أعد للضيوف أو لأفراد البيت ممتاز نزعاً وطعماً وكمية، وهي محدثة لبقة تعرف كيف تصغي متى أرادت، ثم إنها تحب الملابس الفاخرة والعطور الثمينة والموسيقى الكلاسيكية وتكره العيش بمفردها.';
        astrologyDiscribe +=
            'هذه المرأة أيضاً مثـقفة تـثـقيفاً عالياً ينفعها في حياتها الخاصة والعامة، ومع أنها مفطورة على العاطفة إلا أن رجاحة عقلها تدفعها إلى التحرر من تلك العاطفة وخصوصاً في الميادين التي تتطلب المنطق والحكمة، هذا وبسبب أنوثتها الشديدة يظنها البعض ضعيفة مترددة أمام المحن، لكنها من معدن طيّب صلب وذات إرادة حادة تعمل في الأزمات على أفضل نحو وإذاً فليس بالمستغرب أن ( يعبدها ) زوجها من أجل خصالها العديدة بوجه عام ومن أجل لطفها وتوددها بوجه خاص.';
        astrologyDiscribe +=
            'إذا تمنت امرأة برج الميزان أن تـُرزق الأولاد كان دافعها الأساسي إرضاء زوجها لا غير، لذلك من الصعب على أولادها أن يحلـّوا محل أبيهم في قلبها في أي وقت من الأوقات مع أنها تكون لهم أماً ممتازة تحسن رعايتهم وتشرف على نظافتهم وراحتهم وتعاملهم باللين والحُسنى في معظم الأحيان، إلى جانب ذلك لا تتردد في تطبيق النظام وفرض العقوبات بوحي من إدراكها وحكمتها ودون أن تنسى، ولو لحظة، هناء زوجها وراحته، فهل يسعنا بعد ذلك سوى القول هنيئاً له بها';
      }
    } else if (month == 10 && day >= 23 || month == 11 && day <= 22) {
      astrology = "العقرب";
      type = 'المائي';
      color = 'القرمزي والأحمر';
      numbers = '8 - 11 - 18 - 22';
      if (male) {
        astrologyDiscribe =
            'يطبق على هذا الرجل القول التالي : "درهم وقاية خير من قنطار علاج"، وهذه نصيحة نوجهها لكل من يتعامل مع الرجل العقرب عامةً ومن يتعامل مع المرأة العقرب خاصة .. من الأفضل أن تضع درعا واقيا قبل أن تفكر بالتعرض له لأن هذا قد يسبب خطر الانفجار أو الاحتراق على الأقل في الجانب المعنوي، لكنه من الصعب على الكثيرين تصديق هذا الكلام عن العقرب خاصة أؤلائك الذين يتعاملون معه عندما يكون شخصا هادئا وساكنا، لكن شتان بين هذا المظهر وبين ما يخفيه في داخله، ان هذا الذي يظهر منه ليس الا قناع مزيف يهدف من خلاله الى تضليل الاخرين، لكن ما يخفيه هي حقيقته وطبيعته التي يمكننا وصفها بوصف واحد وهو :الانفعال.';
        astrologyDiscribe +=
            'يعتقد بعض الناس أن الرجل العقرب شخص طيب وبسيط، وأقرب ما يكون إلى السذاجة، ويعتقد بعضهم الآخر أنه انسان لئيم مُحب للغدر، ولكن الحقيقة أنه خلاف الحالتين، بالضبط هو رجل فطرعلى حدة الذكاء، وقوة الإرادة، وسرعة الانفعال في ان واحد، أي أن من الصعب جدا قهره مهما حاول أي شخص، وإذا تمادى أحد في الإساءة له،انفجر وحطم كل شيء حوله، يمتلك هذا الرجل عينان حادتان تعدان أقوى ما لديه فيمكنهما اختراق أعماق أي انسان ووضع الأفكار او المشاعر التي يريدها في داخله، هذا الانسان متسلط وقوي الارادة، يسعى للحقيقة أينما وجدت في الموت أو في الحياة أو حتى في المرض أو الحب أو الدين، ولهذا لديه ايمان كبير بضرورة التعمق والابتعاد عن السطحية التي يكرهها بشكل كبير كما يكره الخسارة، فهو ان خسر شيئا حتى لو كان تافها يثور ويتألم من الداخل بدرجة كبيرة قد تؤدي به الى المرض.';
        astrologyDiscribe +=
            'هو إما مُتديّن وملتزم أو مُلحد أو يمتلك من الرياء المقصود ما يكفيه للقيام بالدورين في ان واحد، إن القوانين التي يتبعها من صنعه دائماً، لديه أهداف واضحة وكذلك هي طريقة الوصول إليها، وهو من أجلها لا يهتم للصعاب أو الأخطار حتى لو وصل خطرها الى الموت .. يختار هذا الرجل أصدقائه بصعوبة وذلك لانه يسعى لأعلى المستويات في صداقاته مع الاخرين، ولا يتردد في بعض الأحيان من أن يمارس القسوة أو الطرق السادية حتى بالتعامل مع المرأة التي يحبها ، وبالرغم من ذلك يغار عليها كثيرا ويتألم بشكل كبير اذا تركته الا أنه يكتم ذلك في داخله ويقابل أخطائها معه بالتحدي والعنف حتى لو حطم هذا حياته وسعادته، وبالنسبة لغيرتها هي فلا ينزعج منها أبدا ولا يمكنها الوقوف بينه وبين الاهتمام بالنساء الاخريات، وبالرغم من قوته أمام الغزل والمديح الا أنه من المستحيل أن يفقد سيطرته على نفسه في المواقف العاطفية.';
        astrologyDiscribe +=
            'من الطبيعي أن رجل برج العقرب أباً صارماً بالرغم من حبه الكبير لأطفاله، فهو لا يسمح لهم بتجاوز حدود الأدب والطاعة معه، الا أنه يعلمهم في الوقت ذاته كيفية احترام الذات والاعتماد عليها، من الطبيعي أن يتألموا منه في داخلهم بسبب برودة مظهره، لكنهم وبكل تأكيد يحترمونه ويثـقون ثقة عمياء بكل ما يقول وبكل ما يعمل.';
        astrologyDiscribe +=
            'نعود لعلاقة العقرب بزوجته .. نجد أن هذه العلاقة تــقوم على مبدأ السيد والخادمة، فهو لديه السلطة وهي عليها الطاعة، وهذا المبدأ لا يمكن للعقرب أن يغيره في حياته العاطفية، وبقبول زوجته لهذا المبدأ تأخذ ميزات من الصعب أن تأخذها اي امرأة بالحب، يكفي أن وجود السعادة والرضى في حياة هذا الانسان تحولانه من عقرب سام لاسع إلى نسر عظيم محلق في الأجواء وليس لوحده بل بوجودها وبرفقتها الدائمة له، وبامكانه أن يُعرّفها على أسرار ومفاتن لا يعرفها جميع الذين لا يمتلكون معدنه وطينته العظيمتيــن';
      } else {
        astrologyDiscribe =
            'هي صاحبة جمال ممغنط " مشرقط " أي من الصعب تـفسيره كما من الصعب أيضا مقاومته، تمتلك ثقة واعتزازا كبيرين بالنفس لدرجة الشعور بالأسف على أنها امراة، وليس هذا بسبب كرهها لكونها أنثى بل لأنها ان كانت رجلا سيكون لديها تحررا أكبر وفرصا أوفر، بالرغم من ما تمتلكه من جاذبية شديدة ترفض أن تكتفي بممارسة دور المرأة لايمانها بأنها تستطيع تقديم أكثر من ذلك، ومهما بدر منها من غرابة أو اهمال أو حتى لا مبلالاة في لباسها أو كلامها أو في تصرفاتها، تبقى بالنسبة للكثيرين النموذج المثالي للمرأة الخطرة صاحبة العينين الاسرتين والشكل الخفي، وهي تلقب بالفرنسية المرأة الخطرة "لافام فاتال"، وهو ما يعيد دائما الى أذهاننا صورة المرأة الجاسوسة الجميلة ماتا هاري التي استطاعت أن تدوخ ورائها جيوشا وحكومات.';
        astrologyDiscribe +=
            'تجيد المرأة العقرب القيام بأدواراً مختلفة، وتتمكن من النجاح في الوصول لما تريد، بالرغم من كافة المشاكل الصغيرة أوالكبيرة التي قد تواجهها، سلاحها الأقوى هو امتلاكها للحاسة السادسة التي تمتلكها عادة غالبية النساء الا أنها تتميز بها، الأمر الذي يمكنها من قراءة الأفكار، واستباق الأحداث، وحل الألغاز، كأنها ساحرة حقيقية، وليس من الصعب على امرأة بمواصفاتها الايقاع بالرجل الذي تريد، برغم كرهها الشديد للرجال الذين يمتلكون صفة الضعف .. يجذبها الرجل الوسيم صاحب الشجاعة، الذكاء، العمق والارادة الحقيقية، بتعبير اخر من المستحيل أن تمنح هذه المرأة قلبها سوى للرجل السوبر مان .';

        astrologyDiscribe +=
            'تــُـفضل المرأة من برج العقرب الزواج بالرجل الذي تحبه، لكن اذا لم تتمكن من ذلك اكتفت بممارسة دور الصديقة، من دون أدنى اكتراث لحديث الناس من حولها، وهي بمواجهتها لهذا الرياء الاجتماعي تؤكد أنها أفضل من الكثير من الزوجات الشرعيات، من مميزاتها كزوجة عدم رغبتها تولي القيادة بالرغم من امتلاكها لكافة المقومات التي تؤهلها لاشغال هذا الدور، ودعمها لزوجها ومساندته في طريق النجاح والشهرة، الا أنها ومن ناحية اخرى تغار عليه بشدة متظاهرةً بعكس ذلك، لديها حب للتكتم يجعلها تبقي جزءا من قلبها وتفكيرها في داخلها، بالرغم من اخلاصها الشديد في الحب .. من الصعب على أي امرأة مجاراتها في قوة العاطفة وعمقها، وهي ان أحبت تحب بشدة، وان كرهت تكره بشدة، وان غارت أيضا تغار بشدة، لكن دون أن تظهر ذلك الا اذا وصلت الى درجة عدم الاحتمال حينها تنفجر كالقنبلة وتحطم وتمزق كل ما تراه عينها، لتستعيد بعدها وبسرعة كبيرة سيطرتها على نفسها وهدوئها وبرودة مظهرها، فلا يصدق أحدا أن ما حدث قد صدر عنها بالفعل.';

        astrologyDiscribe +=
            'فضول هذه المرأة يدفعا الى خوض التجربة حيث تغوص فيها من دون أن تشعر بالخوف أو حتى بالتردد، وان هدفها في ذلك التوصل الى المعرفة التامة حتى لو كلفها هذا حياتها، والغريب أنه في كل مرة تخوض فيها تجربة تخرج أكثر قوة وصلابة، والأكثر غرابة أن تصرفاتها لا يمكن أن تثير شكوك أحد أو تقلل من اعتزازها بنفسها، واذا زدنا على كل ما ذكرنا من صفات حبها للتملك ندرك تماما سبب فشل الرجل في محاولاته التحرر من سطوتها.';

        astrologyDiscribe +=
            'تنجح المرأة العقرب في أن تكون زوجة لبحار أو لجندي أو لسياسي، كما وتنجح كثيرا في ادارة بيتها الذي يعكس امتلاكها للذوق الرفيع والنظام الدقيق والرفاهية الكاملة، هي أيضا أم حنونة بالرغم مما يعكسه مظهرها من برودة، تسهر على راحة أطفالها، وتنمي لديهم المواهب، وتبث في داخلهم روح الشجاعة والاقدام، وتعلمهم الاعتماد على النفس، انها وبتعبير اخر امرأة مثيرة وخطرة في الوقت نفسه، لا تسمح لأي أحد بأن يوجه لها اساءة وان حدث تردها له مضاعفة، ترفض أن تخلى عن من تحب، وكما ذكرنا لا يمكن للرجل أن يتحرر من سطوتها وان نجح فلا يستبعد أن يراها كل ليلة في أحلامه .. انها كالساحرات والجنيات اللواتي نسمع عنهن في القصص والحكايات';
      }
    } else if (month == 11 && day >= 23 || month == 12 && day <= 21) {
      astrology = "القوس";
      type = 'الناري';
      color = 'الأزرق';
      numbers = '3 - 7 - 9 - 12 - 21';
      if (male) {
        astrologyDiscribe =
            'أينما وجد رجل القوس كان لديه أصدقاء يلتفون حوله، واذا أضفنا لهذا الحشد الكبير من الأصدقاء والقليل من الأعداء، أهداف رجل القوس المهمة، وعادة التمثـيل والتهريج لديه، وجدنا أن حيز العائلة في حياته قليل نسبياً، أو هكذا يرى أفرادها، بينما هو يرفض هذا القول بشدة.';
        astrologyDiscribe +=
            'هو انسان متـفائل لدرجة الثقة العمياء بالناس والظروف، ولدرجة الاستتفاه بالصعاب والأزمات، أو تحليلها كما يحلو له، لكن لا بد لهكذا تفاؤل الاقتران بوجود الخطر على الرجل القوس، إذ يجعله يعطي ثقته لمن لا يستحقها ويضع قدميه حيث لا يجب أن تكون، لكن الغريب هي تلك الحيوية التي تدفعه ليواصل السير الى الأمام، وتلك الروح الرياضية التي تدعه يتقبل الخسارة بطيب خاطر، وكل ما ذكر هي تأثيرات كوكب "المشتري" عليه، الذي يعطيه حظاً عظيماً بالرغم من كل العثرات التي يواجها.';
        astrologyDiscribe +=
            'قلنا أن أصدقاء هذا الرجل كثيرين، لكن حتى من ضمن هؤلاء أشخاصا يتمنون قتله أحيانا بسبب خشونته وعدم لباقته في التعامل، ومع ذلك يسامح على أخطاؤه بسرعة كبيرة بسبب طيبة قلبه وصفاء سريرته، ويُقال أن كلامه وسهامه قلــّما تخطيء، فان أراد أن يصيب الهدف نجح بدقة هائلة محرجة لخصمه، صراحته المتـناهية تتواجد حتى في المواقف العاطفية، مع العلم أنه يقوم بمعالجة أموره العاطفية بشكل سطحي بعيد عن هدف الزواج الذي يخافه وينـفر منه، ومع أنه يعشق الغزل ويلجأ إليه عندما يحتاجه، إلا أن علاقاته بالنساء تقوم على الكثير من الأسس غير الجنس، فهو يحترم الذكاء إلى جانب الجمال، ويبقى محتفظا بحريته واستقلاله مهما وصل حبه لامرأة معيّـنة.';
        astrologyDiscribe +=
            'هناك نصيحة يجب على المرأة التي ترتبط بهذا الرجل معرفتها وهي: يجب أن تعطيه ثـقتك الكاملة، وأن تمتـنعي عن إظهار غيرتك عليه مهما بدر منه، وأن لا تلجأي للتذمر والشكوى معه مهما كانت الأسباب، كما عليك أن تحب كل من الطبيعة والحيوانات والرياضة مثله، وأن تـتحلي مثله كذلك بالكرم والحماسة والاندفاع، وألا تستهزئين على أفكاره العظيمة وأهدافه النبيلة، مهما كانت خيالية وبعيدة عن الواقع.';
        astrologyDiscribe +=
            'يبتعد رجل برج القوس عن الاهتمام بأهله بعد الزواج، فتصبح علاقته بهم سطحية، ولا تخولهم التدخل في شؤون عائلته وزوجته بشكل خاص، ومقابل ذلك يسعى لبناء علاقات حميمة مع زوجته تساعده على النهوض الذي يعتمد على مبدأ المشاركة مع شريكته في كل أمر، لذا يفترض عليها أن تبدي اهتماما بالأخبار الرياضية، والعالمية، وكذلك بالسباقات على أنواعها، وأن تقرأ المجلات والصحف، وأن تتصف بالمرح والانفتاح، وألا تبتعد عن الواقعية حتى في حالات الانفعال والعاطفة.';
        astrologyDiscribe +=
            'وعلى هذا الأساس فقط يلازم الرجل القوس زوجته، ويصطحبها معه الى أي مكان يذهبه، وينفق عليها بكرم، مع أن كرمه يتعداها إلى كافة أنواع المقامرة مثل المائدة الخضراء والسباق وكذلك البورصة وغيرها من ألعاب الحظ الذي يمارسها كثيرا، ولا يمنعه كرمه عليها من انتقادها بشكل صريح غير مبطن';
        astrologyDiscribe +=
            'يعشق رجل برج القوس أطفاله خاصة عندما يكبروا قليلا ً ويصبحوا في سن تمكنهم من الخروج معه في نزهات ورحلات، إنه يكون لهم كالصديق والأنيس أكثر من الأب، وكثيراً ما يسامحهم على أخطاءهم وهفواتهم لقناعته بأنهم سيكونون أفضل في المستقبل، الا أن الكذب يُـثير جنونه إلى أقصى درجة، أما صراحته الغير محدودة فتـُثير جنون أطفاله تماماً كما يثيرها الكذب بالنسبة إليه.';
        astrologyDiscribe +=
            'إن الرجل القوس بشكل مختصر هو شخص صادق وجرئ وشجاع، لديه بعض الجنون الذي يجعله يرتكب الأخطاء، من الصعب أن يشعر الاخرون بالحقد عليه خاصة زوجته، فهو انسان يملك حبا وطيبة عظيمان يغفران له كل ذنوبه';
      } else {
        astrologyDiscribe =
            'هذه المرأة بعيدة كل البعد عن ما يسمى باللف والدوران، فهي تؤمن ايمانا شديدا بأن الاستقامة هي أقصر الطرق لتحقيق الغايات، وبما أن صفة الاستقامة من صفاتها، فانها توجه بعض الملاحظات والردود والأسئلة التي تربك الجميع بشكل عام والرجل بشكل خاص لأنها تكون فجائية وغير متوقعة، ومع هذا فان من يعرفها جيدا يدرك أن بامكانها أسر كل القلوب ان أرادت.';
        astrologyDiscribe +=
            'المرأة من برج القوس انسانة متـفائلة جداً، الا أن تفاؤلها هذا يقترن بشكل دائم بالمنطق السليم، ويبتعد عن الكذب الذي تكرهه وترفضه لأي سبب من الأسباب، وبما أنها صادقة فهي لا تتردد من الاعتراف أمام عائلتها وأهلها بأنها تفضل القرابة الروحية على القرابة الدموية التي لا تقتنع بها كثيرا، ولصدقها فانها تنفصل مبكرا عن عائلتها وبيتها، وتعيش مستقلة في حياة مليئة بالحركة والنشاط، فهي تحب التنزه، وممارسة الرياضة، والسفر، والالتقاء بالاصدقاء، وملاحقة الأهداف، كما تحب أن تقدم الخدمات لكن بشرط أن لا تكون مفروضة عليها، فهي تكره أن تتقيد أو تجبر، ولا تتورع عن مواجهة ذلك بلسانها الحاد السليط الذي لا يميز أحدا عن اخر، فحتى أمها التي أنجبتها لا يمكنها اجبارها على القيام بأمر ليست مقتنعة به بشكل كامل.';

        astrologyDiscribe +=
            'تكره المرأة القوس الرجل الضعيف الذي لا يملك الإرادة، ومع ذلك لا تقبل بذوبان شخصيتها في شخصية الرجل القوي حتى لو كان رجلا مسيطرا ومتسلطاً، كثيراً ما تتلخبط بين الحب والصداقة، وإذا أحست بالعاطفة تجاه شخص ما تفتح له قلبها من دون تردد، في صدقها صعوبة وخشونة تـزعج البعض، الذين يتهمونها اما باللؤم والخبث أو بالغباء التام، مع أنها في الواقع امرأة ذكية وطيبة ومنطقية بشكل كبير، وإذا تصرفت على هذه الشاكلة التي لا يرضى عنها جميع الناس فلأنها مؤمنة تماماً ببراءتها وحسن تصرفها، وغير مهتمة بالتالي للشائعات والأقاويل والتـُهم التي تلاحقها في بعض الأحيان.';

        astrologyDiscribe +=
            'هذه المرأة تكون مترددة أمام فكرة الزواج فلا تتقبلها الا اذا شعرت بحب كبير جارف وانجذاب شديد تجاه رجل ما تتمنى العيش معه ومشاركته حياتها بل وتقليده في كل شيء، فمثلا هي تحب ارتداء ملابسه أحيانا، وتعشق مرافقته الى الصيد والنزهات والى أي مكان يذهب اليه، تضحكها تصرفاته العفوية، ومع هذا تظل محتفظة بأنوثتها ورقتها، من يعرف هذه المرأة يعلم بأنها بريئة كالأطفال، وهي ترتبك بشكل كبير الى حد التعثر في مشيتها أحيانا، ولا يمكنها منع نفسها من البكاء خاصة في المواقف العاطفية.';

        astrologyDiscribe +=
            'شهية المرأة القوس عظيمة في الأكل، فهي تحب الحصول على الطعام والشراب المميزين، وتعشق الذهاب الى المطاعم الفخمة كلما كان بامكانها ذلك، كما تحب الملابس الأنيقة الفاخرة، والسفر في المقام الأول، وتهوى الأضواء والشهرة وتبذير الأموال فهي تعتقد أن المال وسيلة لا غاية، وبرغم كرهها للأعمال المنزلية الا أنها تفضلها عن العمل في الخارج، وتستطيع القيام بدور ربة المنزل والمضيفة على أحسن وجه، ومن أفضل صفاتها في هذا المجال هو امتلاكها للكرم والمرح وعدم التمييز بين الضيوف مهما اختلفت مستوياتهم الاجتماعية والمادية، من سيئاتها استخدامها اللسان الحاد اذا تم المس بكرامتها، الا انها غير حقودة، فهي مفطلورة على المسامحة والنسيان.';
        astrologyDiscribe +=
            'أطفالها يُحبونها إلى درجة كبيرة جدا، ويمرحون ويلعبون معها كما أنهم داخل " سيرك " حقيقي، وإنهم يتعاملون معها كصديقتهم أوأختهم، ويتعلمون منها الصدق، والاستقامة، والمرح، الا أنهم يشعرون أحيانا بالضيق والارتباك وذلك بسبب صراحتها اللامتناهية، أما زوجها فيلقى منها كل الحب، والثـقة، والوفاء التام، لكن بشرط واحد وهو اعطائها القليل من الحرية والخصوصية.';
        astrologyDiscribe +=
            'امرأة القوس باختصار شديد هي إنسانة مُثيرة لأبعد الحدود، فهي بالإضافة إلى خصالها الحميدة تمتلك روحا خفيفة تضفي الابتسامة والفرح على وجوه الجميع، وتمحو من القلوب كل السأم والملل، وهذا لوحده يُعد فضيلة عند الأزواج';
      }
    } else if (month == 12 && day >= 22 || month == 1 && day <= 20) {
      astrology = "الجدي";
      type = 'الترابي';
      color = 'البني والأسود';
      numbers = '4 - 8 - 13 - 22';
      if (male) {
        astrologyDiscribe =
            'حيط بهذا الشخص جدار صلب من الوحدة والعُزلة، يبدو في الظاهر أنه من صُنع يديه، لكن ضمناً هذا الرجل هو إنسان عاطفي يسعى للحصول على الإعجاب بأي طريقة، الا أن "زحل" الذي يتحكم به وبمصيره يُقيده بالكثير من سلاسل الجدية والواقعية والهدوء وترويض الذات وغيرها من الأمور التي تؤدي لإصابته بالكبت، ويُحاول الرجل الجدي التحرر منها باللجوء الى المزاح الثقيل نوعا ما أو للثورة المفاجئة في بعض الأحيان. من الداخل هو انسان رقيق وبسيط يحلم بالحصول على المغامرة والإثارة والثـناء، وأشياء أخرى بسيطة جدا لا تتعدى وجود الشمس والأزهار والموسيقى وغيرها، إن أصحاب النظرة الثاقبة والبعيدة يدركون أن لهذا الانسان قلباً دافئاً يتوارى وراء طبيعته الزُحَـلية، وبالرغم من تظاهره الدائم بعدم الاهتمام للاخرين الا أنه يحلم بسماع كلمة إطراء واحدة أو الحصول على شهادة طيبة منهم، ان هذا الشخص الجاد الحزيـن كطائر البوم في طفولته، لكنه وبعد الحصول على المساعدة يتحول تدريجياً إلى رجل يشع شباباً وحيوية في الوقت نفسه الذي يبدو فيه غيره في مرحلة الشيخوخة، الأمر الذي يتسبب ببعض القـلق لزوجته وهي التي لم تشعر بالغيرة أو الخوف عليه في بداية علاقتهما، وبهذه المناسبة يوجد بضعة أشياء يجب على الزوجة مراعاتها في حياتها مع هذا الرجل : أولها علاقتها بعائلته التي لها المكان الأول داخل بيته وقلبه، وهذه العلاقـة يفترض أن تكون قائمة من طرفها على أسس الاحترام والاهتمام والرعاية، والأهم عدم محاولة توجيه كلمة نابية لأي فرد من أفراد هذه العائلة سواء من قريب أو بعيد، وان الأمر الثاني هو تجنبها توجيه الإساءة البالغة اليه، وذلك لأنه من أولائك الرجال الذيـن لا يقبلون إعطاء الزوجة فرصة للدفاع عن نفسها، ولا يقبلون بالتالي الرجوع عن القرارت التي اتخذوها حتى لو كان الطلاق من ضمنها. رجل برج الجدي يتأخر في الوقوع بالحب والزواج بسبب تعلقه الكبير ببيت والديه وارتباطه الشديد بأفراد عائلته، يُضاف لذلك أنه شخص حريص جداً في انتقاء شريكة حياته، وهو يختار من تـتمتع في المقام الأول بغريزة الأمومة، ومن تتمكن من البروز داخل المجتمع بذكائها وأصالتها ولياقة مظهرها، وبعد كل هذا ينظر إلى الجمال مع أن الجمال شيئا ثانويا بالنسبة إليه، وهنا علينا توجيه نصيحة للمرأة التي يختارها رجل الجدي وهي: أن تكون هديتها الأولى له كتاب شعر عاطفي، أو كتاب أقوال في الحبّ، حتى تعوده الإفصاح عن مشاعره تجاهها، وذلك لأنه نادر التعبيرعن عاطفته، فهو يُعتقد بالأفعال لا بالأقوال. في المنزل يكون هو السيد، فتراه يجلس على رأس المائدة، ويفرض على أفراد عائلته الالتزام بالطاعة والاحترام له، ويحاول تسيـير العائلة على نظام محدد وتقاليد معروفة، مقابل ذلك لا يتردد في التضحية بنفسه من أجل تحقيق الهناء والسعادة لزوجته وأطفاله، غير أن أطفاله وبالرغم من تقديرهم واحترامهم له، يتألمون في داخلهم بسبب برودة مظهره وجفائه، ويقع على عاتق الزوجة مسؤولية حل هذه المشكلة لديه فيمكنها على سبيل المثال حث أولادها على استخدام أساليب معينة لتحريك مشاعر والدهم تجاههم وبالتالي اظهارها فمثلا يمكنها دفعهم إلى تقبيله واللعب معه، ومن جانبه يمكنها أيضا إقناعه باصطحابهم للتنزه أو لممارسة الرياضة والتسلية مما يؤدي الى انهيار الرسميات بين الأب وأطفاله، و بناء علاقة من الألفة والصداقة بينهم، ومن الطريف أن الرجل الجدي يتغير مع مرور الوقت فيتبدل من أب صارم وشديد إلى جدّ حنون ومبالغ في تدليل أحفاده فيتقبل منهم اللعب والمزاح والضحك وغيرها من الأشياء التي كانت محرمه على أولاده. ان مشكلة رجل برج الجدي مع زوجته وشريكة حياته، أنه يبدو في ظاهره جافاً وكئيباً يتبادل العاطفة معها كما لو أنها كانت واجبا عليه لا أكثر، الا أن حبه في الواقع كبير جدا ويفوق حب كل الرجال لزوجاتهم، سواء كان في عمقه أو حتى في استمراريته، ويكفي أن حرصه الشديد على إسعادها يتوازى مع حرصه على اختيارها، وأنه لا يندم أبدا على ارتباطه بها ما لم تخلق هي الأسباب لجعله يشعر بذلك';
      } else {
        astrologyDiscribe =
            'لا يوجد نموذج محدد يصف المرأة من برج الجدي، فقد تكون عالمة مثلا، أو راقصة، أو حتى عضواً داخل جمعية خيرية، وقد تمتلك أنوثة طاغية، أو قلب بارد، أو مزاج متقلب، وعلى أية حال، مهما كانت هذه المرأة وكيفما بدت يبقى يُلازمها السعي الدؤوب في كافة الوسائل المتاحة للوصول الى السلطة والمركز وطمأنينة العيش، ان المرأة الجدي هي فنانة موهوبة في ميدان ما، ولا بد أن تثبت ذلك في يوم من الأيام، وقد يعود الفضل في تلك المواهب إلى توافقها مع مزاجها واعتدالها مع ميزانها الفطري، ومهما كانت بداياتها بسيطة لا بد وأن تصل للقمة في نهاية المطاف، الا أن الزواج يقف كعقبة أمامها في الغالب لكنها تتقبله طائعة مختارة، ولا تتراجع عن التضحية بعملها في سبيله، إلا إذا كان زوجها بحاجة الى الدعم المادي، فعندها تعمل بكل جد ولا تـنقطع عن هذا العمل حتى تضمن لنفسها ولعائلتها العيش بمستوى مادي ومعنوي لائق.';
        astrologyDiscribe +=
            'تـتمتع هذه المرأة بصفة الأصالة بالرغم من دنائة احتدادها أحياناً، وهي دائمة سيدة رقيقة تتمسك بالتـقاليد، ومع أنها تبدو في ظاهرها صلبة كالجليد، إلا أنها توضع تحت وطأة كافة الأمزجة، ومن أهمها الكآبة التي تلازمها أياما بل أسابيعا في بعض الأحيان، تتصف حالتها في المواقف العاطفية بالتوتر والتقلص فهي لا تعرف الاسترخاء أبدا بسبب انشغالها المستمر بالتخطيط للمستـقبل.';

        astrologyDiscribe +=
            'المرأة من برج الجدي سيدة مجتمع ذو أوصاف كاملة، سواء بلباسها أو بحفاظها على العادات والتقاليد والأصول، تمتلك جمالا طبيعيا، بسبب خجلها الفطري وابتعادها عن استعمال المساحيق خوفاً من اصابة جلدها بالتحسس المزمن، إنها تكره الرياء والكذب، ولا تستخدمهما حتى في موضوع عمرها الذي يكذب بشأنه غالبية النساء، وعلى أية حال هي لا تحتاج إلى ذلك، لأنها تزداد رونقاً وجمالا كلما ازدادت سنا.';

        astrologyDiscribe +=
            'المرأة الجدي لا تقطع علاقتها بأهلها أبدا، بل انها تختار التضحية بسعادتها من أجلهم اذا لزم الأمر، وهي على أتم الاستعداد لتحمّل المسؤولية المادية وكذلك المعنوية تجاههم، حتى بعد زواجها ومن دون أن تـعطي أي وزن لرأي زوجها وشعوره تجاه هذا الموضوع، بالمقابل هي أم صالحة تهتم بأولادها وتقدم لهم أفضل رعاية، فتـعد أفضل الأطعمة من أجلهم، وتلبسهم أفخم الثـياب، وتعنى بأخلاقهم التي تقوم بالأساس على احترام العائلة وكل الأقارب.';

        astrologyDiscribe +=
            'بيتها يكون في غاية النظافة والترتيب، بحيث يـبدو وكأن لديها عشرات الخدم، وبجانب ممارستها لأعمال البيت، تمارس عدد من الهوايات الفنية، وتقرأ كتب التاريخ وقصص الأبطال، تحب الشعر الا أنها تكره الشعراء الذين يعيشون في حياة يسودها الفقر والبطالة، كما تكره كافة أنواع الفشل، وتؤمن بضرورة ضمان العيش الكريم لكل انسان، وهي تحب الموسيقى، وتشارك بالأعمال الخيرية والنشاطات الاجتماعية المتنوعة.';
        astrologyDiscribe +=
            'أخيراً ان امرأة برج الجدي هي زوجة فاضلة بالرغم من عنادها وإصرارها على القيام بتسيـير زوجها، ولو باستخدام الأسلوب الناعم والرقيق، وإن ما يشفع لها عنده هو دعمها المتواصل له، وثقتها العمياء به، والحب الذي يُلازمها تجاهه حتى آخر أيامهما سويا';
      }
    } else if (month == 1 && day >= 21 || month == 2 && day <= 19) {
      astrology = "برج الدلو";
      type = 'الهوائي';
      color = 'الأزرق الفاتح و الفضي';
      numbers = '4 - 7 - 11 - 22 - 29';
      if (male) {
        astrologyDiscribe =
            'قد لا يحب الرجل الدلو كل الناس حباً صادقاً، إلا أن بامكانه التأكيد على أنه يعتبر كل الناس من دون استـثـناء أصدقاءً يستحقون أن يهتم بهم، والدليل على هذا أن كلمة "صديقي" دائمة التردد على لسانه سواء في كلامه مع خصم أو حتى عدو، إن شعور الرجل الدلو تجاه الآخرين بالواقع شعور غامض مُعقــّد فهو يُحيط نفسه بالكتمان والسرية، ويعتبر في الوقت نفسه أن كل شخص أو حدث هو تجربة ذهنية يجب أن يحيطها بالفضول والتحرّي.';
        astrologyDiscribe +=
            'ان حياة هذا الإنسان مليئة بالحوادث المفاجئة والتقـلبات والتناقضات، ومع ذلك وجوده يبعث راحة نفسية للكثيـرين، لكنه يقـلق أثناء سعيه وراء الألغاز، وفي حله للقضايا العويصة، واصابة الأهداف البعيدة المرمى، هذا الشخص هو نموذج للانسان الواسع الصدر الذي يمكنه اقناع نفسه حتى في حالة الهيام والغرام بأن قلبه يتسع لحب العالم بأكمله، وهو بهذه المناسبة ضعيف الاهتمام بالمرأة الواضحة المفتوحة أمامه كالكتاب، بينما ينجذب بشدة للمرأة التي تـُثير حيرته بشخصيتها الغامضة والكتومة، يتظاهر بالطاعة والولاء، فتراه هادئاً مستكيناً الا أن هدوءه ليس حقيقيا، لذلك وبمجرد شعوره باستغلال البعض لطيبته، وخاصة زوجته ينتـفض بقوة كبيرة ويرد على المستغلين باستخدام صلابة غير متوقعة، بالرغم من ذلك يمكننا القول إن إعجابه بتلك المرأة ذات الشخصية القوية وصاحبة الإرادة الصلبة اعجاب لا يمكن وصفه، فهو مثلا ً يحب ألا تغفر له خطاياه بسرعة حتى لا يخيب أمله في قوة وصلابة معدنها، بالعادة يتأخر هذا الرجل في الزواج، بسبب انهماكه في الصداقة واهماله للحب، ولأنه يعتبر أن الانفعالات العاطفية وكذلك العلاقات الجنسية أمراً يزيد من متاعبه، ولا يقدم له السعادة المتكاملة، وهو على أية حال لا يمكن أن يختار غير المرأة التي تعبىء غريزة الصداقة فيه، لكن اذا ما صدر عنها ما يُزعجه مستقبلا تخلى عنها بدون أية صعوبات تـُذكر، وبقي صديقاً وفيا لها لكن ليس أكثر، هذا من جانب، ومن جانب أخر غيرته على زوجته قليلة وثـقته بها عظيمة الى أن تــُثبت العكس، وهو يكون شخصا لائقا في تصرفاته معها سواء في حضورها أوغيابها، بالرغم من كثرة أصدقائه الذين يشغلونه عنها، هو كذلك انسان صادق وصريح يقول الحقيقة إذا سُئل، الا أنه يتعمد الكذب وتلفيق القصص إذاما شك أحد في أمره من دون مبررات.';
        astrologyDiscribe +=
            'رجل برج الدلو انسان نظيف، يحب النظافة لدرجة المرض، وهو مصاب ببعض العقد مثل عقدة الحساسية تجاه عدد من الأماكن والأشياء والعادات، يملك كرما من نوع خاص يدفعه للانفاق ببذخ أحياناً، الا أنه ينتقد تبذير زوجته في أحيان أخرى، لا يعد المال أحد أهدافه الأساسية، الحياة بجانبه ممليئة بالمفاجآت حتى لو خلا بيته من المال، وهو كفيل بإدخال السرور والفرحة لقلب زوجته في كل وقت، ما عدا في المناسبات كمناسبة عيد زواجهم مثلا فهو وبسبب ضعف ذاكرته ينسى تواريخ المناسبات حتى لو كانت مهمة وبالتالي يهمل زوجته عن دون قصد.';
        astrologyDiscribe +=
            'رجل برج الدلو يعشق أولاده ويحبهم حباً شديداً، مما يدفعه للاهتمام بهم وكذلك بألعابهم وعاداتهم وجميع ما يخصهم سواء من قريب أو من بعيد، ومن حسناته كأب امتلاكه القدرة على الإصغاء لأحاديث الصغار حتى لو دامت لفترة طويلة من دون أن يشعر بالملل أو الضيق، ويعرف عنه عدم نسيانه لحبه الأول وعودته إليه، إذا سمحت الظروف، حتى لو بعد سنين طويلة، وسواء ارتبط هذا الرجل بصديقة الطفولة أو لم يرتبط بها، فبدون شك أن المرأة التي سيختارها قلبه ستجد نفسها كأنها "أليس في بلاد العجائب"';
      } else {
        astrologyDiscribe =
            'ان أساس طباع المرأة الدلو هو التـناقض، سواء كان في الحب أو في أي ميدان اخر من الميادين، الا أن تـناقضها هذا يبرز بشكل خاص في الحب، بحيث يمكنها الجمع بيـن الإخلاص الكامل وقلة الاهتمام وعدم الالتزام في آن واحد، لكن لا يوجد غرابة في هذا الأمر فالهواءهو عنصرها وهذا ما يُؤكده علماء الفلك.';
        astrologyDiscribe +=
            'ان المرأة من برج الدلو ترتبط من الناحية العاطفية بكل شخص، وبالتالي بلا أحد، وبالرغم من كونها رقيقة في الحب، الا أنها تبدو غامضة متكتمة، فهي ليست موجودة تماماً مع الانسان الذي تحب وفي الوقت ذاته هي ليست غائبة عنه تماماً، وتعد الحرية والصداقات المتعددة والمشاريع الكثيرة من أقدس الأشياء لديها، فإذا نوى الرجل تحقيق السعادة بقربها عليه ارخاء زمام حريتها، وعدم التذمر إذا خطر ببالها مثلا العودة للدراسة أو الالتحاق بجمعية أو حتى السفر لمكان بعيد يُـتيح لها التمتع والتأمل والاستجمام، في المقابل تـتمتع هذه المرأة بعدد من الخصال الحميدة التي تجعل الرجل يعجب بها كثيرا، يكفي أن المال بالنسبة لها شيء ثانوي إذا ما قارناه بغيره من أسس السعادة، ومن أهدافها الأساسية إيصال زوجها لأعلى مراكز النجاح والمكانة الاجتماعية، وبامكان هذه المرأة التكيّف في كافة الأوساط والطبقات، من دون أن تتخلى عن رقتها وذكائها اللذين أعطاها اياهما الله.';

        astrologyDiscribe +=
            'المرأة الدلو هي انسانة قليلة الانفعال بالحب، تـتمنى أحيانا لو تستطيع الاكتفاء فقط بالعلاقات العذرية، وهي كذلك قليلة الغيرة، ترفض أن تشك فيمن تحب ما لم ترى خيانته بنفسها، في تلك الحالة تـشعر بالحزن والأسى العميقين، ولا تـتراجع عن قرارها بالانفصال عنه، لكن مع الاحتفاظ بصداقته، إنّ الطلاق أمرا ليس صعبا على هذه المرأة بسبب تعدد صداقاتها وامتلاكها طبعا انفراديا يُتيح لها الاستغناء عن أي رجل، وعن كل الرجال بشكل تام أحيانا، المرأة من برج الدلو هي أنثى جميلة جداً، وتعد ثاني أجمل امرأة بعد امرأة برج الميزان، الا أن جمالها من نوع خاص فيحدث عليه التغيـير والتبديل، لأنها تخلط بين الثياب وبين المناسبات الاجتماعية، ولا تـتردد بأن تظهر بأحدث لبس وتسريحة تارة وبلبس قديم يعود لزمن جدتها تارة أخرى، تصرفاتها بشكل عام تتصف بالخجل والتهذيب، وحديثها يشير عن امتلاكها للذكاء واللباقة، لكن عيـبها الصغير هو تـنقلها المتتابع من موضوع لآخر دون سابق إنذار.';

        astrologyDiscribe +=
            'المرأة الدلو ترى أن الأمومة عبارة عن مرحلة دقيقة تحتاج منها التكيّف والتضحية، وهي التي اعتادت توزيع اهتمامها على كل الناس والأحداث، لا شك أنها تحب أولادها، وتهتم بهم، وترعاهم، لكنها تبدو وبشكل دائم بأنها قليلة التعلق بهم، الا أن هذا لا يمنعها من أن تكون أم فاضلة تبث في أطفالها روح الإخاء والتضحية، وتستمع في الوقت ذاته لمشاكلهم بصدر رحب وقلب متسع ومفتوح لكن من دون أن تخنقهم بحبها واهتمامها الزائدين.';

        astrologyDiscribe +=
            'في الزواج تكون هذه المرأة مترددة كثيرا وحائرة، تسعى للجمع بين الحب والصداقة، فلا تستطيع اختيار شريكها إلا بعد التدقيق والتمحيص لمدة طويلة، من أكثر الأشياء التي تكرهها بالرجل الغيرة القوية، وحب التملك، والتبذير الذي يسبب الاستدانة أو الرهن وما يشبهما، أخيراً تـتميز هذه المرأة بامتلاكها حاسة سادسة تعطيها قدرة خارقة تظهر كالسحر في أكثر الأحيان';
      }
    } else if (month == 2 && day >= 20 || month == 3 && day <= 20) {
      astrology = "الحوت";
      type = 'المائي';
      color = 'الأرجواني والبنفسجي';
      numbers = '3 - 9 - 12 - 15 - 18 - 24';
      if (male) {
        astrologyDiscribe =
            'يمرّ الحظ في بعض الأحيان بقرب الرجل الحوت فنراه يحلم أو يتأمل لمعان نجم في السماء، الا أنه يترك هذا الحظ الذي يأتيه ذاهبا لأشخاص آخريـن بدون أن يدرك أبدا أنه خسر فرصة نجاح حقيقية، هل يُسمى هذا ضعفاً أم فشلا ً؟ الجواب لا هذا ولا ذاك، فبامكان هذا الرجل االبحث عن الرزق ان أراد، والوصول إلى أعلى مراكز النجاح بفضل حدسه الذي ورثه عن الإله نبتون.';
        astrologyDiscribe +=
            'من أبرز ملامح شخصية رجل الحوت امتلاكه للفضول الخالي من سواد النية أو الدهشة أو حتى المقاضاة لسلوك الغير، تراه يُـثرثر في بعض الأحيان بدون تفكير، مما يجعله يكشف عن بعض الأسرار الخاصة بغيره دون قصد، الا أنه يرفض بالمقابل البوح بأمر ما مهما تكن الأسباب أوالظروف إن طـُلب منه الكتمان، يتحدث بود، ويفكر بهدوء، ويحاول الا يتدخل فيما لا يعنيه، الا أن مشاكل الغير تلاحقه رغما عنه، وقد يكون السبب في ذلك موهبة الإصغاء عنده، وتمكنه من امتصاص الآلام والأحزان، التي يتعامل معها وكأنها ملكه الخاص، من المفترض على أصدقائه وأقاربه مراعاة صحته، وعدم تحميله أكثر من استطاعته، وأن يقدروا حاجته للراحة والصمت والعزلة، حتى يتمكن من استعادة ما فقده لأجلهم من نشاط وحيوية، ان هذا الرجل إنسان يتصف بالخجل والحساسة، انه يُجرَح بسرعة، ويحتاج من الآخرين ابداء الإعجاب به وتشجيعه لاعتقاده أنه قليل الكفاءة، ومع ذلك يمتلك قابلية عظيمة للعديد من الأشياء كاليوغا والسحر والفلك والتقمص وكل العلوم الباطنية الأخرى، بامكانه قراءة الأفكار، ومعرفة ماذا يمكن أن يحدث، يتـظاهر بعكس ما يكن أحيانا، وهو بامتلاكه لعدة أسرار يشعر بالراحة والطمأنينة.';
        astrologyDiscribe +=
            'ينتظر هذا الرجل من شريكته التي يُحبها الإخلاص الكامل والوفاء التام، وفي نفس الوقت لا يقبل التخلــّي عن أصدقائه من مختلف الجنسين الذيـن يقومون على خدمته بكافة الوسائل وفي كافة الأوقات، الأمر الذي يُشعل غيرة شريكته ونقمتها رغما عنها .. يعجب كثيرا بالجمال، ولا يتردد بالقيام بملاحقة النساء بنظراته التي تعبر عن إحساسه وشعوره، حتى لو نتج عن هذا سوء تفاهم مع المرأة التي يحبها، ويمر رجل الحوت في مرحلة قلق وكآبة لا يدرك مصدرهما فيضطر للانزواء في انتظار اتيان اقتراح من زوجته يساعده على تبديل مزاجه المُتعكر، والرجل من برج الحوت هو شخص مُبذر لا يمكنه التوفير إلا بمرور الوقت وبالحصول على مساعدة زوجته التي بامكانها أن تكون مثله الأعلى في هذا المجال .. هو لأطفاله أكثر من أب، فهو الصديق الذي يُرافقهم للنزهات والرحلات البحرية ويُعلمهم أساسيات السباحة والتجديف واليوغا والكثير من الأمور الأخرى، وهو أيضا مربّي طيب القلب وليـّن الطباع يستمع للمشاكل والمآسي بكل حواسه، أما طريقة التصلب والقسوة فلا يُجيدها ولا يُحب استعمالها، ويُفضل أن تكون من اختصاص زوجته.';
        astrologyDiscribe +=
            'هذا الإنسان يمكنه التخلي عن كل شيء الا أحلامه التي تعد بمثابة روحه، فإذا كانت زوجته تريد الاحتفاظ بحبه إلى الأبد، والابقاء على سعادة عائلتها، عليها أن تقدر هذه الأحلام ولا تسخر منها بأي طريقة من الطرق، وبامكانها بدلا من ذلك، أن تـُشجعه على تغييرها كلها أو بعضا منها إلى واقع مفيد وإيجابي';
      } else {
        astrologyDiscribe =
            'كلما تطورت النساء وأصبحت أكثر تحررا ازدادت شعبية المرأة من برج الحوت، لأنها قد تكون المرأة الوحيدة بين نساء جنسها التي ما زالت ترفض المجد والشهرة، وترغب فقط برجل يحبها ويرعاها ويحميها، في الواقع انه ما من أمر يُسعدها أكثر من الاتكاء على كتـف صلبة وقوية، والإصغاء لصوت معبر، واضح النبرات، يخط الخطط، ويحدد الأهداف، واذا ما أحبت اعتقدت وبإيمان أن بمقدرة من تحبّ حكم العالم بدماغه الفذ، ويديه القويتين، وهو بدوره يتغذى وينتعش بهذا الإعجاب وبهذه الثـقة الكبيرة، فيُصبح بالفعل أقوى وأكثر مقدرة عما قبل.';
        astrologyDiscribe +=
            'امرأة برج الحوت انسانة رقيقة مسالمة تــُشعر من حولها بأنها شاطئ الأمان وحديقة السكينة، هي أنثى بكل ما تحمل الكلمة من معنى مهما اختـلفت الأوقات أو حتى الظروف والمناسبات، عندما تتكلم مع الرجل يشعر فورا بحذر لذيذ يسري بدمه، ويرخي أعصابه المشدودة، ليحلم بأنه مستـلقياً تحت ظل شجرة كبيرة بعيداً عن الضجيج، أو أنه قرب مدفأة تدفئة يستمتع بنارها اللذيذة، انها لا تـلح على الرجل بأي شيء، ولا تستعجله في أي أمر، وان كل ما تسعى للحصول عليه هو العيش بجانبه في حب وسلام.';

        astrologyDiscribe +=
            'من الجائز أن يصدر من المرأة الحوت بعد الزواج عددا من التصرفات الغير لائقة التي لم تظهر منها من قبل، مثلا من الممكن أن يفلت لسانها بكلمات لاذعة، أو تقوم بالتذمر والشكوى، الا أن عيوباً كهذه لا يمكن أن تذكر إذا ما قيست بخصالها الحميدة مثل الرقة والعذوبة والأنوثة وامكانية التكيّف وغيرها من الخصال، علماً بأنها تـفقد في بعض الأحيان معظم هذه الصفات المميزة نتيجة تـلقيها صدمات قاسية متلاحقة، فتـتصرف عندئذ بطريقة عمياء تحطم سعادتها وحياتها بشكل تدريجي، نذكر بالمناسبة أنّها تلجأ لإدمان الكحول والمخدرات كطريقة لمواجهة غدر الزمان، هذا طبعا في الحالات القصوى، أمّا خلال حياتها العادية فتـتمتع هذه المرأة بالذكاء والمراوغة والسرية والغموض وإن كانت كل هذه الصفات، باستثناء الذكاء، مجرد أقنعة يستتر وراءها الخجل والارتباك والتردد وعدم الثـقة بالنفس وكذلك سرعة العطب.';

        astrologyDiscribe +=
            'تـتـظاهر هذه المرأة قبل الزواج بأنها بغنى عن الرجل، في الوقت الذي تحلم فيه بوجود من يرعاها ويبعد عنها الأخطاء، الا أنها وبعد الزواج مباشرة تضع شريكها في منزلة لا يصل اليها حتى أولادها الذيـن تقدسهم، وبالرغم من كونها أم فاضلة، حنونة، تحسن فن الإصغاء والمشاركة الا أنها تـفـتـقر إلى الصلابة اللازمة لتربية الأطفال، ويعرف عنها أنها تخص الطفل الأضعف بين أطفالها بالحنان والعاطفة.';

        astrologyDiscribe +=
            'أخيراً لا تحب هذه المرأة أن تعمل خرج المنزل، وتـتمسك بالأعياد والمناسبات فتعطي الهدايا لأفراد عائلتها، وتـنتظر منهم المعاملة بالمثـل، هي انسانة كريمة تـُنفق بطريقة تقارب التبذير، لكنها ترضى بالقليل إذا واجهتها ظروف صعبة، ومهما يكن مستواها المادي والاجتماعي تعد هذه المرأة مثالا للمرأة الحقيقية بل للأنوثة الكاملة';
      }
    }
  }
}
