import 'dart:io';
import 'package:age/age.dart';
import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:firebase_storage/firebase_storage.dart';
import 'package:flutter/material.dart';
import 'package:image_picker/image_picker.dart';
import 'package:new_chat/services/constense.dart';
import 'package:new_chat/services/database.dart';
import 'package:new_chat/services/helperFunctions.dart';
import 'package:new_chat/views/chatRooms.dart';
import 'package:new_chat/widgets/widget.dart';
import 'package:intl/intl.dart';

class UserInfoScreen extends StatefulWidget {
  final String userName;
  final String roomID;
  final String userEmail;
  final String userImage;

  UserInfoScreen(
      {Key key, this.userName, this.roomID, this.userEmail, this.userImage})
      : super(key: key);

  @override
  _UserInfoScreenState createState() => _UserInfoScreenState();
}

class _UserInfoScreenState extends State<UserInfoScreen> {
  bool imageSourceVisible = false;
  Future<bool> _onBackPressed() {
    if (widget.roomID == null) {
      return Navigator.push(
        context,
        MaterialPageRoute(
          builder: (context) => ChatRooms(),
        ),
      );
    } else {
      Navigator.pop(context);
    }
    return null;
  }

  String astrology = "";
  String astrologyDiscribe = "";
  getAstrology(int month, int day, bool male) {
    if (month == 3 && day >= 21 || month == 4 && day <= 20) {
      astrology = "برج الحمل";
      if (male) {
        astrologyDiscribe =
            "الرجل الاكثر اثارة وغرابة في الحب يتوهج تارة ويبرد تارة أخرى لذا ننصح المرأة التي تميل الى الاستقرار بعلاقاتها أن تبتعد عن رجل هذا البرج .. عندما يحب فانه يعطي كل ما عنده بنبل وجدية وتظهر عليه علامات الحب من شرود وتنهدات ويعد الاخلاص والصدق من أهم سماته فهو يخلص لحبيبته حتى في تفكيره لكنه يحاول أن لا يظهر لها ذلك وينتظر مقابلا منها فعليها أن تحافظ عليه وتخلص له اخلاصا تاما وتحاول ارضائه دائما بأن تحب ما يحبه وتكره ما يكرهه وتقف معه ضد أعداءه ويتوقع منها المغفرة والنسيان لأخطاءه مهما بلغت من الأذى لها وان فشلت تركها ليذهب الى حبيبة أخرى ترضيه واذا ما تحطم حبه يلملمه ويحاول بث الروح فيه من جديد أما اذا عجز عن ذلك ذهب للبحث عن حب جديد .. ومن أهم ما يجعل الحمل يترك محبوبته ويبحث عن اخرى اذا حاولت النظر الى غيره فهو رجل غيور محب للتملك واذا حاولت امرأة التقرب منه بالغزل الصريح فانه يلغي التفكير فيها بشكل تام.";
        astrologyDiscribe +=
            "يعد التمرد والتحدي من أهم صفاته لذلك كثيرا ما يقع بالمشاكل ويتعرض لعقوبات قاسيه من سلطته بسبب غروره وعدم انصياعه للأوامر فهو لا يفضل دور التابع أبدا ويحاول دوما أن يكون سيدا لاعتقاده بأنه الأذكى وان فقد رجل الحمل شعوره بالصدارة سواء بالبيت أو العمل فانه يتحول الى رجل كئيب منطوي فاقد للحيوية والايجابية.";
        astrologyDiscribe +=
            'رجل هذا البرج كما ذكرنا يعشق كونه في الصدارة فاذا ما عدنا وتحدثنا عن علاقته بمحبوبته فانه على استعداد دائم أن يبذل كل ما لديه في سبيل ارضائها فيقوم بالانفاق عليها بسخاء وهنا نوجه ملاحظه الى شريكة رجل الحمل بأن تكون مدبرة وتدخر لأوقات الحاجة التي يمر بها كثيرا هذا الرجل لايمانه بالمثل القائل "اصرف ما بالجيب يأتيك ما في الغيب" وكنوع من الاخلاص للمحبوبة يصر رجل الحمل البقاء الى جانبها عند مرضها والاهتمام بها ومدحها والثناء عليها منميا لديها شعورها بالانوثة واذا ما حدث بينهما سوء تفاهم ليس لديه أي مشكلة بأن يبادر بالاعتذار حتى لو كان الحق معه انه يجعلها سيدة النساء وأكثرهن سعادة في حبه لكن بشرط أن يبقى هو السيد صاحب الصدارة في هذه العلاقة والا تركها بلا تردد ومن غير عودة.';
        astrologyDiscribe +=
            'عندما يكون الرجل الحمل في بيته كما يريد "السيد" فانه يكون رجلا محبا لأولاده موفرا لهم جميع وسائل الفرح والمرح والنزهات واللعب والعزومات خارج المنزل ويشاركهم ذلك من غير تردد ويكره رجل الحمل أن تهمله زوجته لأجل أبنائه أو لأجل عملها الذي لا يعترض عليه بشرط الاهتمام به وبنفسها بمحافظتها دائما على أنوثتها وجمالها والأهم تبعيتها التي تمنعها المس باستقلاله لكنها تستطيع التدخل في شؤونه ان كانت تملك الذكاء بأسلوب لبق وبوقت مناسب مع اشعاره دوما بأنه السيد ورجل الحمل يكره الكذب والتحايل وهو دائما صادق مع زوجته في جميع تصرفات واذا شعر بالبرود تجاهها فانه لا يستطيع اخفاء ذلك فنبرة صوته وايماءات وجهه وجسده تفضح مشاعره';
      } else {
        astrologyDiscribe = "";
      }
    } else if (month == 4 && day >= 21 || month == 5 && day <= 21) {
      astrology = "برج الثور";
      if (male) {
        astrologyDiscribe =
            'لا نكون مخطئين إذا استـنـتجنا مما ذكرناه في صفاته العامة وطفولته أن رجل برج الثور حريص رزين قليل الحركة بطيء التفكير، لكن الخطأ كله أن نعتقد أنه بارد الشعور عديم العاطفة كما يتصوره البعض، أمر لا يُصدق ولكنه الواقع: هذا الإنسان القوي الضخم يُسيره كوكب السلام والحب المعروف باسـم فينوس أو الزهرة، من النادر أن يقع في الحب من أول نظرة، أو أن ينغمس فيه حتى أذنيه بالسرعة التي اشتهر بها البعض، لكنه متى استقر رأيه وتأكدت له حقيقة شعوره اندفع نحو مصدر إلهامه وحبه بكامل ما يملك من قوة وحيلة ووسائل، وهو في هذا المضمار لا يعرف الكلل والملل، يدأب مثلا على إرسال الأزهار إلى الحبيبة يوميا، يستعين على صدها ودلالها بالشعر أو الغناء أو العزف أو الرسم أو أي ملكة أخرى يتمتع بها، وبما أنه شهواني الطبع يطري مفاتـنها الجسدية كنعومة جلدها أو جمال شعرها أو شذى عطرها، قد لا يكون أسلوبه في التعبير رفيعا وشاعريا إلى الدرجة التي يُجيدها البعض ولكنه يعرف حتما كيف يُلين قلبها في النهاية بفضل التكرار والمثابرة، ويطغي عليه عامل التناقض في جميع تصرفاته وتحركاته، مثلا قد يُهدي حبيبته يوما معطف فراء باهظ الثمن، وتمر الأيام تلو الأيام دون أن يُقدم لها شيء، ثم فجأة يشتري لها باقة بنفسج متواضعة من بائعة عجوز ينقدها أضعاف الثمن لا لسبب سوى أنها تـُذكره بأمه.';
        astrologyDiscribe +=
            'يُضاف إلى هذا أن وسائل التعبير عنده متعددة متلونة، يلجأ تارة إلى أرقى الفنادق والمطاعم، وأخرى تكفيه نزهة في الغابة أو سباق في ضوء القمر، كثيرا ما يعتمد على الموسيقى والأغاني لشرح مشاعره، ولا يُستبعد أن يختار أغنية أو لحنا معينا يرمز به إلى مكانة الحبيبة عنده، إلى جانب ذلك نجده واقعيا قليل الأحلام لا يستعمل لغة الأوهام كغيره من المحبين، فبدلا من أن " يقطف لحبيبته النجوم والقمر وينقلها على بساط الريح إلى جزيرة بعيدة لا تضم سواها "، وبدلا من كر الكلام والأحلام يأتي إليها حاملا بيده خريطة منزل من حجر وإسمنت حقيقي، إذا وعد وفى وإذا أقدم على مشروع حققه من حسابه الخاص لا بالدين أو الرهن أو غير ذلك، وهو أيضا مخطط بارع، يسخر حاضره لغده، كالسنجاب النشيط الذي يجمع في الصيف غذاء الشتاء.';

        astrologyDiscribe +=
            'لا نستطيع القول أن حياة المرأة مع هذا الإنسان سعادة مستمرة، وخصوصا إذا ظهر منها ما لا يقره، من الأشياء التي يبغضها فيها الصراخ والعنف والتحدي، ومع أنه يُقدر الذكاء إلا أنه يُفضل عليه المنطق والرجاحة، من الخير لزوجة مولود برج الثور أن تتصرف بصورة لائقة في الأماكن العامة وإلا واجهها أحد احتمالين : إما أن يرد بعنف يصل إلى حد الصفع واللكم أو يتظاهر بالإهــمال والاحتــــقار، وفي كلا الموقفين ما يُربك الزوجة ويُخجلها دون ريب، ومن الأفضل لها أن تصون كرامتها في البداية.';
        astrologyDiscribe +=
            'من ناحية أخرى يهوى رجل برج الثور الريف والطبيعة والأزهار والنزهات الطويلة وكرة القدم وصيد الأسماك والتخيـيم في الهواء الطلق، كما يحب المطالعة ويُفضل الأبطال والناجحين على القصص البوليسية المعقدة أو المواضيع الفلسفية العميقة، ومع أنه يرتاد المطاعم والفنادق إلا أنه يُفضل طعام البيت ويتمنى أن تـُجيد زوجته الطهو ولو اضطرت إلى تعلمه من كتاب أو صديقة، ذلك لا يعني أنه يريدها طاهية لا غير، والبرهان على ذلك دعواته المتكررة وإغداقه الثياب والحلي عليها وكل ما من شأنه أن يُظهرها بالمظهر اللائق.';
        astrologyDiscribe +=
            'يقوم رجل برج الثور بدور الوالد على أفضل وجه، فهو يعتز بأبنائه الذين يحملون اسم العائلة، ويخص بناته بالعطف والدلال، وهو صبور طويل البال لا يُسيئه مثلا أن يتعلم أولاده ببطء ما داموا مستمرين في التقدم، ومن الصفات التي يسعى لتنميتها فيهم الاعتدال والطموح والمحافظة على المال والأملاك، وهو فوق ذلك سخي لا يبخل عليهم شيء، ولكنه لا يتردد في تأديبهم متى دعت الحاجة إلى ذلك، وبما أن رجل برج الثور دؤوب كثير العمل فإنه يحتاج إلى الراحة بين الحين والآخر، فإذا لم يجدها أصبح قلقا عصبي المزاج، يسيئه جدا أن يتهمه البعض، وخصوصا زوجته، بالكسل، إنه بطيء ولكن غير كسول، والزوجة الفطنة هي التي تدرك الفرق بين الظاهرتين، من ناحية أخرى إذا أرادت حقا إسعاده وإرضاءه عليها أن تخصه بمقعد وثير يؤمن له الراحة والاسترخاء، وأن تحيطه بجو ساكن تتخلله الموسيقى الخفيفة، وأن تغطي جسمه في أوقات البرد بغطاء صوفي ناعم لأن من طبع هذا الإنسان حب الأشياء ذات الملمس الناعم.';
        astrologyDiscribe +=
            'إذا تأمنت جميع هذه الشروط لرجل برج الثور أصبح من خيرة الأزواج إن لم يكن أفضلهم، يكفي أنه في حالات الشكر والامتنان يغض الطرف عن أخطاء كثيرة ينتقدها الرجال الآخرون في المرأة عادة';
      } else {}
    } else if (month == 5 && day >= 22 || month == 6 && day <= 21) {
      astrology = "برج الجوزاء";
      if (male) {
        astrologyDiscribe =
            'ان من أبرز صفات رجل الجوزاء القلق وعدم ميله للارتباط، ومن المهم جدا أن لا تغيب هاتان الصفتان عن عقل المرأة التي تنوي الارتباط بهذا الرجل، وعليها أن تعلم أن الحب لديه شيء مختلف عن الشيء الذي يرغب به في مزاجه الخاص، هذه النظرية لوحدها كفيلة بهدم أكثر البيوت سعادة واستقرارا إلا إذا ضحت الزوجة وتحملت وأخلصت الى أقصى الحدود الممكنة، في هذه الحالة ستـنـقلب حياتها لنعيم دائم، لأن رجل الجوزاء يمتلك مزايا قليلة الوجود في الرجال الاخرين، يكفي أن الوقت معه يمر كلمح البصر، وأنه لا يعرف الرتابة والملل، وإذا نطق كلمة أحبك لزوجته، نطقها لعشرات الأسباب وبكل اللهجات، يدعوها الى المطاعم أو المسارح أو دور اللهو أو المتاحف أو حتى الشواطئ والجبال وأماكن أخرى كثيرة لا تخطر على بالها قط بطرق طريفة وجديدة، يتحدث معها في كل الأمور وعن كل المواضيع لأنه يعرف الكثير فهو انسان متطلع ومثقف يكاد لا يجهل شيئا ..من ناحية أخرى قد يخرج رجل الجوزاء من البيت بنية الرجوع بعد ساعة لكنه يقضي أياما خارجه ويبدو أحيانا مشغولا يفكر طيلة الوقت ونظراته تائهة لا وجود له بالبيت الا بجسده مما يجعل زوجته محتارة متسائلة تفكر بألف احتمال وتحسب لألف حساب.';
        astrologyDiscribe +=
            'رجل الجوزاء سواء كان حبيبا صديقا أو زوجا، يتميز بالذكاء والمرح والاثارة، لكنه سريع الضجر وشخصيته هوائية متقلبة، إذا أهمل أصدقائه ونسيهم فلا يكون السبب وراء ذلك قلة الوفاء لهم انما هناك تغيرات تطرأ على حياته ونفسيته فتجعله متعطشا لنمط حياة جديد، ولهذا السبب أيضا من الصعب عليه التعلق بماضيه سواء كان هذا الماضي عبارة عن ذكريات أو أماكن أو أشياء أخرى.';
        astrologyDiscribe +=
            'يكره هذا الرجل العزلة والوحدة لفترات طويلة، ويُفضل مخالطة مستويات مختلفة من البشر، إنه متحدث لبق ودقيق الملاحظة يضفي جوا من المرح والسرور على جلساته، ولو خُـيّر لاختار أن يتزوج أكثر من مرة، ولأن الأمر ليس بهذه السهولة يستعيض عنه بأشياء أخرى فيمثلك مثلا أزواجا من البيوت والسيارات والهوايات الخ، هذه الازدواجية تظهر كذلك في قضايا المال، فهو يبدو سخيا لأبعد الحدود تارة وبخيلا لدرجة الشح تارة أخرى.';
        astrologyDiscribe +=
            'رجل الجوزاء انسان محبوب من قبل الأطفال عامة ومن قبل أطفاله بشكل خاص، تربطه بهم علاقات قوية وحميمة تقوم على الثقة والصراحة وتبادل الآراء وكذلك المعلومات، ومن سيئاته القليلة كأب الفشل في فرض النظام واطلاق الكثير من الوعود التي يستصعب تحقيقها، وتسيء حدة لسانه لكرامة أطفاله في بعض الأحيان لكنه يملك طيبة قلب غالبا ما تغفر له أخطاءه.';
        astrologyDiscribe +=
            'انه رجل قليل الغيرة لابتعاده عن حب التملك، الحب في رأيه يتخطى مفهوم الارتباط الجسدي، إنه مشاركة روحية وعقلية وجسدية معاً، يمتلك جاذبية في المناسبات لا يمكن مقاومتها، يكره ملاحقة الفرص لكنه يقبلها بطيب خاطر ان أتت بدون عناد.';
        astrologyDiscribe +=
            'يقال أن الازدواجية لدى هذا الرجل قد تجعله يسعى لحبين في آن واحد، لكن لا يعني هذا بأنه يحن لامرأتين في وقت واحد، بالحقيقة ان أمره غير مفهوم ..من الصعب على أية حال أن يرضى الرجل الجوزاء بالمرأة قليلة الذكاء، ولن يذهب إلا لصاحبة الفطنة والحيلة والمرونة، ومن السهل على مثل هذه المرأة أن تفهم سر طبيعته و أن تظهر له على النحو الذي يحبه ويرضي ازدواجيته';
      } else {}
    } else if (month == 6 && day >= 22 || month == 7 && day <= 22) {
      astrology = "برج السرطان";
      if (male) {
        astrologyDiscribe =
            'التكتم كلمة مرادفة لرجل برج السرطان الذي يجهله أكثر الناس قربا منه، فإذا كانت ثـقته بالمقربين اليه على هذا الشكل فكيف هي اذن بالنسبة للغرباء ؟ على كل حال، يبقى تهذيب ولطف هذا الشخص كاملين لا يعتريهما أي نقص، وكذلك هو صدقه مع نفسه، فهذا الانسان لا يتغير ولا يتبدل مهما تغيرت الظروف والأحوال.';
        astrologyDiscribe +=
            'يتأرجح رجل برج السرطان بين التعمق والسطحية، وكذلك بين الثبات والتقلب، ويصاب في بعض الأحيان بنوبات أقرب ما تكون الى الجنون، وإذا خاف من فقدان شيء عزيز عليه أصبح انسانا لئيماً سيئ المزاج، تعامله مع الناس واحتكاكه فيهم يُولد لديهم شعورا غريبا يبدأ وكأنه بارد في المرة الأولى ليتحوّل بعدها إلى حرارة ودفء، شخص حريص على ماله فلا يُفرط في نقوده أبداً ويتظاهر بالحاجة وينجح بأدائه لهذا الدور إلى الحد الذي يدفع بعض الأشخاص لعرض المال عليه فهم لا يعرفون أنه يمتلك الكثير ويخزنها في البنوك، اقتصادي من الدرجة الأولى فهو يعرف جيدا متى ينفق وكيف ينفق وإذا أسرف مرة لسبب قاهر لا يُعيدها مهما حدث معه، الا أنه يزور المطاعم الفخمة لقناعته بأن ما يأكله فيها شيء يستحق أن يدفع المال عليه، ويرتدي أفخم الملابس بعد أن يقوم بشرائها في موسم التـنزيلات، ويقتـني العديد من الأشياء الثمينة التي تبقى طويلاً.';
        astrologyDiscribe +=
            'على زوجة هذا الرجل الشعور بالطمأنينة وعدم الخوف من حدوث أزمات مالية في المستقبل، فالمال متوفر، والتوفير مضمون، ولا يوجد أية ديون، لكن من الجائز أن تكون حزينة وتعيسه اذا كانت امرأة ذات طبيعة حساسة مع هذا الزوج الذي لا يفكر الا بتخزين الأموال وتكديسها، لكن وعلى أية حال عليها العلم بأن تجميع الثروة عند زوجها هو غاية لا وسيلة.';
        astrologyDiscribe +=
            'رجل السرطان انسان نظيف وأنيق ويفضل ارتداء الملابس الرسمية أو الكلاسيكية على غيرها، إذا قرر اقتناء سيارة اختار الأجود والأغلى ثمنا لعلمه أنها متينة وستبقى لديه فترة طويلة أكثر من غيرها، معطف زوجته مصنوع من الفراء الأصلي للسبب ذاته، يميل الى حب الفن وهذا أمر مستغرب عليه، ولكنه فنان ويحب على وجه الخصوص التصوير الفوتوغرافي والرسم، ولا يُستبعد عنه انتاج لوحات جيدة لاستعملها في التجارة والربح.';
        astrologyDiscribe +=
            'في الحب يكون رجل برج السرطان انسانا مترددا يفكر طويلا قبل الإقدام على الخطوة الأولى ليقينه أن المرأة التي تستحق أن ترتبط به نادرة الوجود،و قد يكون سببا من أسباب تردده تعلقه ببيت والديه وبأمه التي يقدرها ويحترمها بشكل كبير، إذا وجد المرأة التي يريدها تمسك بها بكل ما يملك من قوة وعاملها معاملة الأطفال،الا أنه يبقى مترددا في مصارحتها بحقيقة مشاعره بداية الأمر مُفضلاً أن تقوم هي بالخطوة الأولى، الثوب الأنيق الجذاب والعطر الذكي والجو الرومانسي الممتلأ بالموسيقى والأزهار هو أقوى سلاح قد تستخدمه محبوبته معه وهي وسائل كافية لسلب قلبه وعقله معا، لكن إذا أرادت الاستمرارية في هذه العلاقة عليها اجادة فن الإصغاء خاصة عندما يُحدثها عن نفسه كأصله وعائلته وماضيه، وبالأخص أمه التي تكاد تكون المنافسة الوحيدة لها في حبه.';
        astrologyDiscribe +=
            'رجل برج السرطان هو أب عطوف وصبور وحنون، يشرف بنفسه على رعاية أولاده وطعامهم ونومهم، وتأخذ بناته الجزء الأكبر من هذه الرعاية، وسواء أكانوا صبياناً أم بناتاً يكره جداً أن يستلقوا عنه عندما يكبروا';
      } else {}
    } else if (month == 7 && day >= 23 || month == 8 && day <= 22) {
      astrology = "برج الاسد";
      if (male) {
        astrologyDiscribe =
            'ليس بالخبز وحده يعيش رجل برج الأسد، هذه الحقيقة يجب ألا تغيب عن ذهن شريكة عمره إذا أرادت له حقاً حياة كريمة مملوءة بالسعادة والرضى، ولتعلم أن أهم العوامل التي يتغذى بها على الصعيدين النفسي والجسدي هي الحب والاحترام والثناء، ولتكن دائماً على حذر من مظهره الوديع لأن وراءه روحاً أبيّة لا تـُمَس، وإذا مُسّت ردّ بعنف وتحدّ غير متوقعين.';
        astrologyDiscribe +=
            'رجل برج الأسد مع المرأة خلوق عاطفي ومتسلط في آن واحد، يتمتالرجل الأسد:';
        astrologyDiscribe +=
            'لا يمكن لرجل برج الأسد العيش بالخبز وحده، وهذه الأمر يجب أن يبقى في ذهن شريكة الرجل الأسد إذا أرادت له بالفعل حياة كريمة مليئة بالسعادة والرضى، وعليها العلم بأن الحب والاحترام وكذلك الثناء هم الغذاء الجسدي والروحي لهذا الانسان، وعليها الحذر من مظهره الوديع الهادئ لأن وراءه شخصية قوية لا يمكن المساس بها، وإذا مُسّت كان رده عنيفا ومتحديا بصورة غير متوقعة.';
        astrologyDiscribe +=
            'انه خلوق وعاطفي مع المرأة الا أنه يملك شخصية متسلطة .. يتمتع بطاقة حب كبيرة جدا وقابلة للانفجار عند أول إشارة، وان لم يتمكن من التنفيس عنها ذبل وظهر و كأنه يعيش في مأساة حقيقية.';
        astrologyDiscribe +=
            'وإذا حالفه الحظ والتقى بالشريكة المثالية انقلب إلى بركان حقيقي يطلق حمم العشق والإعجاب والبذخ، فتراه يتعامل مع محبوبته بوسائل ملتهبة، ودعوات متتالية، وهدايا فاخرة، والكثير المغريات الأخرى التي يستحيل مقاومتها، لذلك لا بد للانسانة التي تحصل على هذا الحب العظيم والاهتمام الكبير تقديم المقابل الا أن هذا المقابل هو التضحية بجزء من حريتها وأعصابها في بعض الأحيان، ذلك لأن الرجل الأسد كالسجّان وإن كان سجنه هذا من الذهب، وهذا كله بسبب غيرته الشديدة على محبوبته من جميع الرجال، وتراه يتدخل في شؤونها سواء كانت كبيرة أم صغيرة، ولا يتردد في استخدام العنف إذا شك بسلوكها أو إخلاصها له .. بالنسبة لزوجة هذا الرجل عليها اظهار الطاعة له، وابداء إعجابها به، واغماض عينيها عن حبه للعظمة الذي يبدو واضحا جدا في شخصيته، ومحاولة مواجهة حماسه واندفاعه باستخدام الرزانة والتعقل.';
        astrologyDiscribe +=
            'من أكثر الأمور التي يرفضها هذا الرجل وبإصرار عمل زوجته في الخارج، ولعله يخشى منافستها له على هذا الصعيد، الا أنه لا يتردد في تقديمها لأصدقائه وهي بأجمل صورها ليتفاخر بها أمامهم، وتتصف معاملته لهاً بالاحترام والكرم والحماية دائما .. لديهما حياة اجتماعية مليئة وإن كان يقوم بممارسة حياة العزوبية من فترة لأخرى فمثلا يخرج مع أصحابه إلى مقهى أو مطعم أو في رحلة مثلا، ان مشكلته الأساسية هي المقامرة وحب المغامرة بالمال، لذلك على زوجته بذل ما في وسعها لابقاءه بعيداً عن المزايدات والمقامرة والبورصة وأي شيء يشكل خطراً على وضعه المالي، وليس التبذير فقط هوايته، فهو أيضا يعشق العمل الميكانيكي ويفهم للآليات والمحركات، ولا يستعصي عليه المجال الكهربائي وكذلك النجارة ومشتـقاتها، انه أيضا يحب البناء، وقد يتمكن من أن يبني غرفة إضافية في بيته أو يصنع بيديه مفروشات البيت.';
        astrologyDiscribe +=
            'يُعتبر رجل برج الأسد في الاحتفالات والمناسبات مصدرا للتسلية والمرح، الا أن هذا الأمر لا يمنعه من المحافظة على كرامته وقدره بالشكل الملائم، وبما أنه يعشق الجمال ويُقدره بشكل كبير قد يبدو في بعض الأحيان منشغلا عن زوجته بتأمله الوجوه الحسنة، لكن بنية غير سيئة لا يقصد بها الخيانة، على كل حال يملك هذا الرجل ابتسامة مشرقة وقلب طيب كفيلان بمحو أخطاءه سواء مع زوجته أو مع الآخرين، وكثيراً ما يختار رجل الأسد زوجة دون مستواه كي يبقى محتفظاً بدور السيد بشكل كامل، وإذا فشل بالاختيار وشعر بأن زوجته تنافسه في السلطة أصبح تعيساً مُعكر المزاج، ومن المعروف عنه عدم حبه لانجاب الكثير من الأولاد على الرغم من كونه أب عطوف محب لأبنائه ومهتم لرعايتهم.';
        astrologyDiscribe +=
            'شخصية هذا الشخص إجمالاً مُحيّرة، وكل من يتعامل معه يجد نفسه أمام سلسلة كبيرة من التساؤلات: "هل هذا الانسان حقاً معطاء أم هو رجل أناني يحب نفسه فقط؟ هل يمتلك صفات الزعامة أم أنه يتظاهر بامتلاكها؟ هل هو شخص اجتماعي كما يدّعي؟".. هناك شيء لدى الرجل الأسد ولا يمكن لأي انسان انكاره انها كفاءته بالحب والعمل.';
        astrologyDiscribe +=
            'عقدة رجل الأسد هي الخوف من أمرين وهما الفشل وسخرية الناس، وفيما لو لقي التشجيع الضروري أصبح لا يخشى شيئا، العيش لجانبه متعة حقيقية إذا تمكنت المرأة من نسيان ذاتها واحترامه معا.';
        astrologyDiscribe +=
            'ع بطاقة حب عظيمة قابلة للتفجر عند أول إشارة، إذا لم يستطع التنفيس عنها ذبل وأوحى بأنه يعيش مأساة حقيقية.';
        astrologyDiscribe +=
            'وإذا أسعفه الحظ ولقي رفيقته المثالية انقلب إلى بركان حيّ يطلق حمم الغرام والإعجاب والبذخ، وسائله مع الحبيبة وسائل ملتهبة، ودعوات متلاحقة، وهدايا فاخرة، وغير ذلك من المغريات التي يصعب بل يستحيل مقاومتها، مقابل ذلك لا بد للمرأة التي تحصل على مثل هذا الحب العظيم من أن تدفع ثمنه من حريتها وأعصابها أحياناً، ذلك بأن رجل برج الأسد أشبه بالسجّان وإن كان سجنه من ذهب، إنه يغار على حبيبته من جميع الرجال، ويتدخل في شؤونها الكبيرة والصغيرة، ولا يتردد في إظهار العنف إذا راوده الشك في سلوكها وإخلاصها، بالنسبة إلى زوجة هذا الرجل عليها أن تـُظهر له الطاعة، وأن تـُبدي إعجابها به، وأن تـُغمض عينيها عن مركب العظمة الذي يبدو فيه بوضوح، وأن تـُواجه حماسه واندفاعه بالرزانة والتعقل.';
        astrologyDiscribe +=
            'من الأمور التي يرفضها رجل برج الأسد بإصرار عمل الزوجة في الخارج، ولعل سبب ذلك خشيته المنافسة، بالمقابل لا يتردد في إظهارها أمام الأصدقاء وهي على أتم هندام وزينة مما يُشعره بالسعادة والفخر، إلى جانب ذلك تـتسم معاملته لها دائما ً بالنبل والكرم والحماية، حياتهما الاجتماعية ملآنة وإن كان يمارس حياة العزوبية بين الفينة والأخرى فيخرج عندئذٍ مع الأصحاب إلى مقهى أو مطعم أو غيره، مشكلته الأساسية المقامرة والمغامرة بالمال، وعلى زوجته أن تعمل ما في وسعها ليبقى بعيداً عن المزايدات والبورصة وكل ما يشكل خطراً على أوضاعه الاقتصادية، ليس التبذير هوايته الوحيدة لحسن الحظ فهو ميكانيكي من الطراز الأول يفهم الآليات والمحركات وغير ذلك، حقل الكهرباء لا يُستعصى عليه وكذلك النجارة ومشتـقاتها، حتى البناء، وقد يصل به الأمر إلى حد صنع مفروشات البيت أو بناء غرفة إضافية.';
        astrologyDiscribe +=
            'في الحفلات يُعتبر عنصر تسلية ومرح، لكن الهزاز لا يُفقده شيئاً من كرامته وقدره، وبما أنه يُحب الجمال ويُقدره حق قدره يبدو أحياناً مشغولاً عن زوجته بتأمل الوجوه الحسنة، لكن تصرفه هذا يخلو من سوء النية ولا يُشكل سبباً للغيرة، على كل حال ابتسامته المشرقة وقلبه الطيب كفيلان بمحو هفواته سواء عند زوجته أو عند الآخرين، وكثيراً ما يتزوج من امرأة دونه مستوى كي يظل محتفظاً بدور السيد المطلق، وإذا أساء الاختيار وشعر أن زوجته تنافسه في العرش بدا تعيساً مُعكر المزاج، من الطريف أن لا ينجب رجل برج الأسد العديد من الأولاد مع أنه والد عطوف كثير الرعاية لأبنائه.';
        astrologyDiscribe +=
            'شخصية هذا الإنسان إجمالاً مُحيّرة، فجميع الذين يتعاملون معه يجدون أنفسهم أمام سلسلة من التساؤلات: "هل هو حقاً معطاء أم أنه رجل أناني لا يُحب سوى نفسه ؟ هل عنده صفات الزعامة أم يتظاهر بأنه يملكها ؟ هل هو اجتماعي كما يدّعي؟". شيء واحد على الأقل موجود عنده ولا يستطيع أحد إنكاره وهو كفاءته في الحب والأعمال.';
        astrologyDiscribe +=
            'أخيراً عقدة رجل برج الأسد الخوف... الخوف من الفشل ومن سخرية الناس، إذا لقي التشجيع اللازم عاد لا يرهب شيئاً، العيش إلى جانبه متعة إذا تمكنت المرأة من إنكار ذاتها واحترامه في آن واحد';
      } else {}
    } else if (month == 8 && day >= 23 || month == 9 && day <= 22) {
      astrology = "برج العذراء";
      astrology = "برج الاسد";
      if (male) {
        astrologyDiscribe =
            'لم يُخلق هذا الرجل للمرأة العاطفية المتعطشة للحب ولعبارات الوجد والهيام، وإذا وقعت امرأة كهذه في حب رجل العذراء فستتحول نارها الى صقيع يوما ما بسبب برودة ملامحه، ونظرته المادية، وأفكاره البعيدة عن الخيال والأحلام، لكن واقعيته تتمحور بالغالب حول حياته الفكرية وليس من المستحيل أن يعيش علاقة حب طبيعية فمن الممكن جدا أن يدخل في علاقة ويحب ويعشق كأي رجل طبيعي، لكنه حتى وان أحب لا يصل الى القمة في هذا الحب فلن يشبه قيس وليلى أو روميو وجولييت، فهو يجهل فن البكاء والشوق واللوعة، ويفضل وسائل التعبير العملية أكثر كحسن المعاملة والاحترام والرعاية والإخلاص.';
        astrologyDiscribe +=
            'يظهر هذا الرجل للوهلة الأولى كأنه مصنوع من الفولاذ والثلج معا، ومع ذلك يوجد وسائل تمكن المرأة من غزو قلبه المحصن، إلا أنها بعيدة عن الغنج والملاحقة والرجاء والإصرار وعن كافة الطرق الأخرى التي قد تسلكها المرأة عادة لتصل الى من تحب، الرجل العذراء انسان يهتم بنوع الحب وليس بكميته، لذلك من الصعب أن يقع فيه، وإذا وقع بشكل جاد سرعان ما اكتشف أن حظه عاثر في هذا المجال، فيحاول نسيان عذابه في عمله، ويبتعد عن الناس، ويُضاعف من اجراءات الحيطة والحذر حتى لا يقع في حب أخر.';
        astrologyDiscribe +=
            'المرأة مع هذا الشخص يجب أن تتحلى بالصبر، والتأني، والحذر، هذا من جانب، ومن جانب اخر عليها أن تعرف بأن الطهارة أمر مقدس لديه، وأن حياة العزوبية التي يعيشها ليست صعبة عليه كما تعتقد، فإذا واجهته بعض العراقيل في زواجه ليس لديه أية مشكلة في أن يلغي فكرة الزواج ويبقى عازبا، وهو مقتنع وراضي بذلك .. يتمتع هذا الرجل بسحر كبير لا يوصف، ولا يعلم أحد بالضبط ما سر انجذاب الاخرين نحوه، ولماذا أكثر القلوب حصانة تهوي أمام جاذبيته الشديدة، يتميز بامتلاكه للفكر الحاد والمادة الصلبة، وهو انسان متواضع يحب التحليل والاختبار، من الصعب عليه إقامة العلاقات الجسدية البحتة، فهو يترفع حتى عن القضايا الجنسية، والحب لديه أقرب للطهارة والبراءة منه للشهوة، وبسبب ميله للانتقاد يستهلك رجل العذراء فترة طويلة في البحث عن الشريكة المناسبة له، وبكلام آخر من الصعب تحريك هذا الإنسان عاطفيا إن لم يكن أمرا مستحيلا ،، خاصة أنه يحب العيش وحيدا، ويستطيع البقاء هكذا طوال حياته من دون الشعور بأي نوع من الحنين للزوجة أو الشريكة.';
        astrologyDiscribe +=
            'بعض رجال برج العذراء يمارسون العلاقات الجنسية الصرفة لارضاء فضولهم فقط، وليُثبتوا لأنفسهم أن رجولتهم كاملة، وبمجرد اثبات ذلك يلغوا تلك العلاقات من حياتهم ويذهبوا للاهتمام بما هو أسمى وأهم بنظرهم، ولكن اذا دخل العذراء حبا حقيقيا كان صادقا ووفيا، ومن الايجابيات التي تعرف عنه في الزواج ميله للاهتمام بأبسط الأمور لارضاء زوجته، وبذل كل ما بوسعه لإزالة كافة العقبات من طريقها، ويهتم العذراء كثيرا في المحافظة على الروابط العائلية طالما لا يوجد سبب وجيه يدعو إلى عكس ذلك، وبالرغم من أن غيرته ليست شديدة، لكن العزة والكرامة قد تقوده أحياناً إلى الطلاق.';
        astrologyDiscribe +=
            'يُفضل الرجل العذراء الزوجة التي تهتم ببيتها ومطبخها وتعتني بنظافة أولادها، ولا يهتم كثيرا لأن يُرزق بأطفال، لكن إذا رزق بهم أحسن رعايتهم واهتم لتربيتهم ونمى فيهم الخلق الرفيع، وأوجد لديهم الفكر السامي وعزز المواطنة الصحيحة .. هم يتعلمون منه حب الثـقافة والعلم واحترام الفكر والآداب، لكن هناك قلق من قيام حاجز من البرودة والجفاء بين هذا الأب وأبنائه مع مرور الوقت، وليس لأي سبب واضح سوى خوفه وتردده من اظهار الحب والحنان لهم.';
        astrologyDiscribe +=
            'مهما يحمل هذا الرجل من عيوب يبقى لديه من الحسنات والقيم والأخلاق ما يكفي لكي تشعر كل نساء العالم بالغيرة من الزوجة التي اختارها بفكره وقلبه';
      } else {}
    } else if (month == 9 && day >= 23 || month == 10 && day <= 22) {
      astrology = "برج الميزان";
      if (male) {
        astrologyDiscribe =
            'لا شك أنه أكرم الناس في توزيع النصائح بلا مقابل، عنده الجواب الشافي لكل سؤال وقضية وإن كان صعباً عليه الوقوف موقف المحايد بصورة مستمرة، فحبه للجدل واستناده إلى المنطق والتحليل يدفعانه إلى المجاهرة بآرائه الخاصة بأسلوب فذ يقنع الآخرين على الرغم منهم في كثير من الأحيان، سحره عظيم إلى الدرجة التي يستحيل معها التحرر منه، ابتسامته ولطفه كثيراً ما يمحوان سيئاته عند من يحب فلا ينسى الإساءة وحسب بل تلازمه الابتسامة أيضاً مثل ظله وتعمل المستحيل كي يهنأ ويسعد.';
        astrologyDiscribe +=
            'الحب مع هذا الإنسان عملية صعبة يتخلـّلها صعود وهبوط على الرغم من تأثيرات كوكب الزهرة ( فينوس) في سير حياته، لا شك أن سبب تلك الصعوبة يعود إلى عادة التـفكير والتمحيص عنده، وهو لا يكتـفي بإطالة فترة الدرس وحسب بل يتورع أيضاً عن الرجوع عن قراراته في اللحظة نفسها التي يشعر فيها بأنه غير مقتـنع تماماً، مما يدفع الكثيرين إلى اعتـقاد أنه لئيم الطبع بارد الشعور غير أهل للثقة، غير أن الواقع عكس ذلك تماماً، إن طبيعة رجل برج الميزان والعاطفة مترادفان على الرغم من كل التناقضات التي عُرفت عنه وهو يمارس الحب وحسب بل عرف كيف يصقله وكيف يجعله أرقى منه في جميع الأبراج الأخرى.';
        astrologyDiscribe +=
            'من الصعب أن يفشل هذا الإنسان في محاولاته مع الحبيبة، لكن الطريف في الأمر هو أنه حالما ينجح في مهمته يأخذ في إظهار التردد والتساؤل عن جدوى الاستمرار، ذلك التردد الذي يكاد يشبه الخوف لا يفقده على كل حال اهتمامه بالجنس الآخر حتى في مرحلة الشيخوخة، وقد يكون أحد أسباب تعلـّق النساء به أسلوبه القائم على المناورة وعدم الرفض من البداية، لكنه " تكتيك " معقد يُعذب المرأة أكثر من الرفض دون ريب، إذا نظرنا إلى رجل الميزان في مرحلة الشباب وجدناه هوائياً متقلب المزاج غالباً ما يخلط بين الصداقة والحب، وهو إذا شاء لنفسه النسيان والسلوى استطاعهما دون كبير عناء أو ندم، لكن ألمه الحقيقي أعظم منه عند الآخرين، ولا نكون مبالغين إذا قلنا أنه في مرحلة العذاب ينهار ويتحوّل إلى حطام.';
        astrologyDiscribe +=
            'فضول الرجل في برج الميزان محدود، وهو إذا ناقش فعل ذلك بطريقة مجردة بغية الوصول إلى النظريات الصحيحة لا أكثر، أي أن اهتمامه بالنظريات يفوق اهتمامه بالإنسان نفسه، إن قابليته لدرس الحقائق دون الدوافع تضعه في مصاف القضاة لا الأطباء النفسييـن، تلك هي على كل حال مشكلته الأساسية مع شريكة حياته التي يجهل كوامنها النفسية على الرغم من وضوح الرؤية ومهارة الاستنتاج المعروفين عنه، مقابل ذلك لا يعلو شيء على مكانة الزوجة عنده، وهي، أي الزوجة، تأتي قبل أولاده الذين يعزهم من كل قلبه، وبهذه المناسبة نقول أن دوره كأب يتسم بطابع الحكم والمرشد، فهو يحمي أبناءه الصغار من تعسف أخوتهم الكبار، ويعطي هؤلاء ما يستحقونه من الحرية والاستقلال دون أن يتأثر بمن هم أصغر سناً، بفضله يسود الهدوء والنظام في البيت في معظم الأحيان، وإذا حدث من أولاده أمر يستحق العقاب قام بالواجب دون تردد ودون أن يتخلـّى قيد شعرة عن أسلوب المنطق الذي يتمسّك به في جميع أقواله وأعماله.';
        astrologyDiscribe +=
            'الرجل في برج الميزان ميسور الحال إجمالا ً على الرغم من كثرة إنفاقه على الأشخاص والأشياء التي تعتبر مصدر الجمال والسعادة، وهو يستضيف الناس بكثرة، ومع ذلك يكره الاختلاط بالغرباء والجموع الغفيرة كما يكره الأماكن المغلقة والضجيج والفوضى، ثم إنه يهوى التنسيق والترتيب والنظافة والهدوء والأماكن الفسيحة والهواء المنعش ولهذا السبب يبدو بيته أشبه شيء بالواحة وسط ضجيج وغبار ولهاث العالم الخارجي.';
        astrologyDiscribe +=
            'أخيراً لا بد من كلمة إلى المرأة التي تقع في حب رجل الميزان : لا تيأسي من تردده وحذره، كوني إيجابية واخطي الخطوة الأولى فهو يستحق منك المبادرة';
      } else {}
    } else if (month == 10 && day >= 23 || month == 11 && day <= 22) {
      astrology = "برج العقرب";
      if (male) {
        astrologyDiscribe =
            'يطبق على هذا الرجل القول التالي : "درهم وقاية خير من قنطار علاج"، وهذه نصيحة نوجهها لكل من يتعامل مع الرجل العقرب عامةً ومن يتعامل مع المرأة العقرب خاصة .. من الأفضل أن تضع درعا واقيا قبل أن تفكر بالتعرض له لأن هذا قد يسبب خطر الانفجار أو الاحتراق على الأقل في الجانب المعنوي، لكنه من الصعب على الكثيرين تصديق هذا الكلام عن العقرب خاصة أؤلائك الذين يتعاملون معه عندما يكون شخصا هادئا وساكنا، لكن شتان بين هذا المظهر وبين ما يخفيه في داخله، ان هذا الذي يظهر منه ليس الا قناع مزيف يهدف من خلاله الى تضليل الاخرين، لكن ما يخفيه هي حقيقته وطبيعته التي يمكننا وصفها بوصف واحد وهو :الانفعال.';
        astrologyDiscribe +=
            'يعتقد بعض الناس أن الرجل العقرب شخص طيب وبسيط، وأقرب ما يكون إلى السذاجة، ويعتقد بعضهم الآخر أنه انسان لئيم مُحب للغدر، ولكن الحقيقة أنه خلاف الحالتين، بالضبط هو رجل فطرعلى حدة الذكاء، وقوة الإرادة، وسرعة الانفعال في ان واحد، أي أن من الصعب جدا قهره مهما حاول أي شخص، وإذا تمادى أحد في الإساءة له،انفجر وحطم كل شيء حوله، يمتلك هذا الرجل عينان حادتان تعدان أقوى ما لديه فيمكنهما اختراق أعماق أي انسان ووضع الأفكار او المشاعر التي يريدها في داخله، هذا الانسان متسلط وقوي الارادة، يسعى للحقيقة أينما وجدت في الموت أو في الحياة أو حتى في المرض أو الحب أو الدين، ولهذا لديه ايمان كبير بضرورة التعمق والابتعاد عن السطحية التي يكرهها بشكل كبير كما يكره الخسارة، فهو ان خسر شيئا حتى لو كان تافها يثور ويتألم من الداخل بدرجة كبيرة قد تؤدي به الى المرض.';
        astrologyDiscribe +=
            'هو إما مُتديّن وملتزم أو مُلحد أو يمتلك من الرياء المقصود ما يكفيه للقيام بالدورين في ان واحد، إن القوانين التي يتبعها من صنعه دائماً، لديه أهداف واضحة وكذلك هي طريقة الوصول إليها، وهو من أجلها لا يهتم للصعاب أو الأخطار حتى لو وصل خطرها الى الموت .. يختار هذا الرجل أصدقائه بصعوبة وذلك لانه يسعى لأعلى المستويات في صداقاته مع الاخرين، ولا يتردد في بعض الأحيان من أن يمارس القسوة أو الطرق السادية حتى بالتعامل مع المرأة التي يحبها ، وبالرغم من ذلك يغار عليها كثيرا ويتألم بشكل كبير اذا تركته الا أنه يكتم ذلك في داخله ويقابل أخطائها معه بالتحدي والعنف حتى لو حطم هذا حياته وسعادته، وبالنسبة لغيرتها هي فلا ينزعج منها أبدا ولا يمكنها الوقوف بينه وبين الاهتمام بالنساء الاخريات، وبالرغم من قوته أمام الغزل والمديح الا أنه من المستحيل أن يفقد سيطرته على نفسه في المواقف العاطفية.';
        astrologyDiscribe +=
            'من الطبيعي أن رجل برج العقرب أباً صارماً بالرغم من حبه الكبير لأطفاله، فهو لا يسمح لهم بتجاوز حدود الأدب والطاعة معه، الا أنه يعلمهم في الوقت ذاته كيفية احترام الذات والاعتماد عليها، من الطبيعي أن يتألموا منه في داخلهم بسبب برودة مظهره، لكنهم وبكل تأكيد يحترمونه ويثـقون ثقة عمياء بكل ما يقول وبكل ما يعمل.';
        astrologyDiscribe +=
            'نعود لعلاقة العقرب بزوجته .. نجد أن هذه العلاقة تــقوم على مبدأ السيد والخادمة، فهو لديه السلطة وهي عليها الطاعة، وهذا المبدأ لا يمكن للعقرب أن يغيره في حياته العاطفية، وبقبول زوجته لهذا المبدأ تأخذ ميزات من الصعب أن تأخذها اي امرأة بالحب، يكفي أن وجود السعادة والرضى في حياة هذا الانسان تحولانه من عقرب سام لاسع إلى نسر عظيم محلق في الأجواء وليس لوحده بل بوجودها وبرفقتها الدائمة له، وبامكانه أن يُعرّفها على أسرار ومفاتن لا يعرفها جميع الذين لا يمتلكون معدنه وطينته العظيمتيــن';
      } else {}
    } else if (month == 11 && day >= 23 || month == 12 && day <= 21) {
      astrology = "برج القوس";
      if (male) {
        astrologyDiscribe =
            'أينما وجد رجل القوس كان لديه أصدقاء يلتفون حوله، واذا أضفنا لهذا الحشد الكبير من الأصدقاء والقليل من الأعداء، أهداف رجل القوس المهمة، وعادة التمثـيل والتهريج لديه، وجدنا أن حيز العائلة في حياته قليل نسبياً، أو هكذا يرى أفرادها، بينما هو يرفض هذا القول بشدة.';
        astrologyDiscribe +=
            'هو انسان متـفائل لدرجة الثقة العمياء بالناس والظروف، ولدرجة الاستتفاه بالصعاب والأزمات، أو تحليلها كما يحلو له، لكن لا بد لهكذا تفاؤل الاقتران بوجود الخطر على الرجل القوس، إذ يجعله يعطي ثقته لمن لا يستحقها ويضع قدميه حيث لا يجب أن تكون، لكن الغريب هي تلك الحيوية التي تدفعه ليواصل السير الى الأمام، وتلك الروح الرياضية التي تدعه يتقبل الخسارة بطيب خاطر، وكل ما ذكر هي تأثيرات كوكب "المشتري" عليه، الذي يعطيه حظاً عظيماً بالرغم من كل العثرات التي يواجها.';
        astrologyDiscribe +=
            'قلنا أن أصدقاء هذا الرجل كثيرين، لكن حتى من ضمن هؤلاء أشخاصا يتمنون قتله أحيانا بسبب خشونته وعدم لباقته في التعامل، ومع ذلك يسامح على أخطاؤه بسرعة كبيرة بسبب طيبة قلبه وصفاء سريرته، ويُقال أن كلامه وسهامه قلــّما تخطيء، فان أراد أن يصيب الهدف نجح بدقة هائلة محرجة لخصمه، صراحته المتـناهية تتواجد حتى في المواقف العاطفية، مع العلم أنه يقوم بمعالجة أموره العاطفية بشكل سطحي بعيد عن هدف الزواج الذي يخافه وينـفر منه، ومع أنه يعشق الغزل ويلجأ إليه عندما يحتاجه، إلا أن علاقاته بالنساء تقوم على الكثير من الأسس غير الجنس، فهو يحترم الذكاء إلى جانب الجمال، ويبقى محتفظا بحريته واستقلاله مهما وصل حبه لامرأة معيّـنة.';
        astrologyDiscribe +=
            'هناك نصيحة يجب على المرأة التي ترتبط بهذا الرجل معرفتها وهي: يجب أن تعطيه ثـقتك الكاملة، وأن تمتـنعي عن إظهار غيرتك عليه مهما بدر منه، وأن لا تلجأي للتذمر والشكوى معه مهما كانت الأسباب، كما عليك أن تحب كل من الطبيعة والحيوانات والرياضة مثله، وأن تـتحلي مثله كذلك بالكرم والحماسة والاندفاع، وألا تستهزئين على أفكاره العظيمة وأهدافه النبيلة، مهما كانت خيالية وبعيدة عن الواقع.';
        astrologyDiscribe +=
            'يبتعد رجل برج القوس عن الاهتمام بأهله بعد الزواج، فتصبح علاقته بهم سطحية، ولا تخولهم التدخل في شؤون عائلته وزوجته بشكل خاص، ومقابل ذلك يسعى لبناء علاقات حميمة مع زوجته تساعده على النهوض الذي يعتمد على مبدأ المشاركة مع شريكته في كل أمر، لذا يفترض عليها أن تبدي اهتماما بالأخبار الرياضية، والعالمية، وكذلك بالسباقات على أنواعها، وأن تقرأ المجلات والصحف، وأن تتصف بالمرح والانفتاح، وألا تبتعد عن الواقعية حتى في حالات الانفعال والعاطفة.';
        astrologyDiscribe +=
            'وعلى هذا الأساس فقط يلازم الرجل القوس زوجته، ويصطحبها معه الى أي مكان يذهبه، وينفق عليها بكرم، مع أن كرمه يتعداها إلى كافة أنواع المقامرة مثل المائدة الخضراء والسباق وكذلك البورصة وغيرها من ألعاب الحظ الذي يمارسها كثيرا، ولا يمنعه كرمه عليها من انتقادها بشكل صريح غير مبطن';
        astrologyDiscribe +=
            'يعشق رجل برج القوس أطفاله خاصة عندما يكبروا قليلا ً ويصبحوا في سن تمكنهم من الخروج معه في نزهات ورحلات، إنه يكون لهم كالصديق والأنيس أكثر من الأب، وكثيراً ما يسامحهم على أخطاءهم وهفواتهم لقناعته بأنهم سيكونون أفضل في المستقبل، الا أن الكذب يُـثير جنونه إلى أقصى درجة، أما صراحته الغير محدودة فتـُثير جنون أطفاله تماماً كما يثيرها الكذب بالنسبة إليه.';
        astrologyDiscribe +=
            'إن الرجل القوس بشكل مختصر هو شخص صادق وجرئ وشجاع، لديه بعض الجنون الذي يجعله يرتكب الأخطاء، من الصعب أن يشعر الاخرون بالحقد عليه خاصة زوجته، فهو انسان يملك حبا وطيبة عظيمان يغفران له كل ذنوبه';
      } else {}
    } else if (month == 12 && day >= 22 || month == 1 && day <= 20) {
      astrology = "برج الجدي";
      if (male) {
        astrologyDiscribe =
            'حيط بهذا الشخص جدار صلب من الوحدة والعُزلة، يبدو في الظاهر أنه من صُنع يديه، لكن ضمناً هذا الرجل هو إنسان عاطفي يسعى للحصول على الإعجاب بأي طريقة، الا أن "زحل" الذي يتحكم به وبمصيره يُقيده بالكثير من سلاسل الجدية والواقعية والهدوء وترويض الذات وغيرها من الأمور التي تؤدي لإصابته بالكبت، ويُحاول الرجل الجدي التحرر منها باللجوء الى المزاح الثقيل نوعا ما أو للثورة المفاجئة في بعض الأحيان. من الداخل هو انسان رقيق وبسيط يحلم بالحصول على المغامرة والإثارة والثـناء، وأشياء أخرى بسيطة جدا لا تتعدى وجود الشمس والأزهار والموسيقى وغيرها، إن أصحاب النظرة الثاقبة والبعيدة يدركون أن لهذا الانسان قلباً دافئاً يتوارى وراء طبيعته الزُحَـلية، وبالرغم من تظاهره الدائم بعدم الاهتمام للاخرين الا أنه يحلم بسماع كلمة إطراء واحدة أو الحصول على شهادة طيبة منهم، ان هذا الشخص الجاد الحزيـن كطائر البوم في طفولته، لكنه وبعد الحصول على المساعدة يتحول تدريجياً إلى رجل يشع شباباً وحيوية في الوقت نفسه الذي يبدو فيه غيره في مرحلة الشيخوخة، الأمر الذي يتسبب ببعض القـلق لزوجته وهي التي لم تشعر بالغيرة أو الخوف عليه في بداية علاقتهما، وبهذه المناسبة يوجد بضعة أشياء يجب على الزوجة مراعاتها في حياتها مع هذا الرجل : أولها علاقتها بعائلته التي لها المكان الأول داخل بيته وقلبه، وهذه العلاقـة يفترض أن تكون قائمة من طرفها على أسس الاحترام والاهتمام والرعاية، والأهم عدم محاولة توجيه كلمة نابية لأي فرد من أفراد هذه العائلة سواء من قريب أو بعيد، وان الأمر الثاني هو تجنبها توجيه الإساءة البالغة اليه، وذلك لأنه من أولائك الرجال الذيـن لا يقبلون إعطاء الزوجة فرصة للدفاع عن نفسها، ولا يقبلون بالتالي الرجوع عن القرارت التي اتخذوها حتى لو كان الطلاق من ضمنها. رجل برج الجدي يتأخر في الوقوع بالحب والزواج بسبب تعلقه الكبير ببيت والديه وارتباطه الشديد بأفراد عائلته، يُضاف لذلك أنه شخص حريص جداً في انتقاء شريكة حياته، وهو يختار من تـتمتع في المقام الأول بغريزة الأمومة، ومن تتمكن من البروز داخل المجتمع بذكائها وأصالتها ولياقة مظهرها، وبعد كل هذا ينظر إلى الجمال مع أن الجمال شيئا ثانويا بالنسبة إليه، وهنا علينا توجيه نصيحة للمرأة التي يختارها رجل الجدي وهي: أن تكون هديتها الأولى له كتاب شعر عاطفي، أو كتاب أقوال في الحبّ، حتى تعوده الإفصاح عن مشاعره تجاهها، وذلك لأنه نادر التعبيرعن عاطفته، فهو يُعتقد بالأفعال لا بالأقوال. في المنزل يكون هو السيد، فتراه يجلس على رأس المائدة، ويفرض على أفراد عائلته الالتزام بالطاعة والاحترام له، ويحاول تسيـير العائلة على نظام محدد وتقاليد معروفة، مقابل ذلك لا يتردد في التضحية بنفسه من أجل تحقيق الهناء والسعادة لزوجته وأطفاله، غير أن أطفاله وبالرغم من تقديرهم واحترامهم له، يتألمون في داخلهم بسبب برودة مظهره وجفائه، ويقع على عاتق الزوجة مسؤولية حل هذه المشكلة لديه فيمكنها على سبيل المثال حث أولادها على استخدام أساليب معينة لتحريك مشاعر والدهم تجاههم وبالتالي اظهارها فمثلا يمكنها دفعهم إلى تقبيله واللعب معه، ومن جانبه يمكنها أيضا إقناعه باصطحابهم للتنزه أو لممارسة الرياضة والتسلية مما يؤدي الى انهيار الرسميات بين الأب وأطفاله، و بناء علاقة من الألفة والصداقة بينهم، ومن الطريف أن الرجل الجدي يتغير مع مرور الوقت فيتبدل من أب صارم وشديد إلى جدّ حنون ومبالغ في تدليل أحفاده فيتقبل منهم اللعب والمزاح والضحك وغيرها من الأشياء التي كانت محرمه على أولاده. ان مشكلة رجل برج الجدي مع زوجته وشريكة حياته، أنه يبدو في ظاهره جافاً وكئيباً يتبادل العاطفة معها كما لو أنها كانت واجبا عليه لا أكثر، الا أن حبه في الواقع كبير جدا ويفوق حب كل الرجال لزوجاتهم، سواء كان في عمقه أو حتى في استمراريته، ويكفي أن حرصه الشديد على إسعادها يتوازى مع حرصه على اختيارها، وأنه لا يندم أبدا على ارتباطه بها ما لم تخلق هي الأسباب لجعله يشعر بذلك';
      } else {}
    } else if (month == 1 && day >= 21 || month == 2 && day <= 19) {
      astrology = "برج الدلو";
      if (male) {
        astrologyDiscribe =
            'قد لا يحب الرجل الدلو كل الناس حباً صادقاً، إلا أن بامكانه التأكيد على أنه يعتبر كل الناس من دون استـثـناء أصدقاءً يستحقون أن يهتم بهم، والدليل على هذا أن كلمة "صديقي" دائمة التردد على لسانه سواء في كلامه مع خصم أو حتى عدو، إن شعور الرجل الدلو تجاه الآخرين بالواقع شعور غامض مُعقــّد فهو يُحيط نفسه بالكتمان والسرية، ويعتبر في الوقت نفسه أن كل شخص أو حدث هو تجربة ذهنية يجب أن يحيطها بالفضول والتحرّي.';
        astrologyDiscribe +=
            'ان حياة هذا الإنسان مليئة بالحوادث المفاجئة والتقـلبات والتناقضات، ومع ذلك وجوده يبعث راحة نفسية للكثيـرين، لكنه يقـلق أثناء سعيه وراء الألغاز، وفي حله للقضايا العويصة، واصابة الأهداف البعيدة المرمى، هذا الشخص هو نموذج للانسان الواسع الصدر الذي يمكنه اقناع نفسه حتى في حالة الهيام والغرام بأن قلبه يتسع لحب العالم بأكمله، وهو بهذه المناسبة ضعيف الاهتمام بالمرأة الواضحة المفتوحة أمامه كالكتاب، بينما ينجذب بشدة للمرأة التي تـُثير حيرته بشخصيتها الغامضة والكتومة، يتظاهر بالطاعة والولاء، فتراه هادئاً مستكيناً الا أن هدوءه ليس حقيقيا، لذلك وبمجرد شعوره باستغلال البعض لطيبته، وخاصة زوجته ينتـفض بقوة كبيرة ويرد على المستغلين باستخدام صلابة غير متوقعة، بالرغم من ذلك يمكننا القول إن إعجابه بتلك المرأة ذات الشخصية القوية وصاحبة الإرادة الصلبة اعجاب لا يمكن وصفه، فهو مثلا ً يحب ألا تغفر له خطاياه بسرعة حتى لا يخيب أمله في قوة وصلابة معدنها، بالعادة يتأخر هذا الرجل في الزواج، بسبب انهماكه في الصداقة واهماله للحب، ولأنه يعتبر أن الانفعالات العاطفية وكذلك العلاقات الجنسية أمراً يزيد من متاعبه، ولا يقدم له السعادة المتكاملة، وهو على أية حال لا يمكن أن يختار غير المرأة التي تعبىء غريزة الصداقة فيه، لكن اذا ما صدر عنها ما يُزعجه مستقبلا تخلى عنها بدون أية صعوبات تـُذكر، وبقي صديقاً وفيا لها لكن ليس أكثر، هذا من جانب، ومن جانب أخر غيرته على زوجته قليلة وثـقته بها عظيمة الى أن تــُثبت العكس، وهو يكون شخصا لائقا في تصرفاته معها سواء في حضورها أوغيابها، بالرغم من كثرة أصدقائه الذين يشغلونه عنها، هو كذلك انسان صادق وصريح يقول الحقيقة إذا سُئل، الا أنه يتعمد الكذب وتلفيق القصص إذاما شك أحد في أمره من دون مبررات.';
        astrologyDiscribe +=
            'رجل برج الدلو انسان نظيف، يحب النظافة لدرجة المرض، وهو مصاب ببعض العقد مثل عقدة الحساسية تجاه عدد من الأماكن والأشياء والعادات، يملك كرما من نوع خاص يدفعه للانفاق ببذخ أحياناً، الا أنه ينتقد تبذير زوجته في أحيان أخرى، لا يعد المال أحد أهدافه الأساسية، الحياة بجانبه ممليئة بالمفاجآت حتى لو خلا بيته من المال، وهو كفيل بإدخال السرور والفرحة لقلب زوجته في كل وقت، ما عدا في المناسبات كمناسبة عيد زواجهم مثلا فهو وبسبب ضعف ذاكرته ينسى تواريخ المناسبات حتى لو كانت مهمة وبالتالي يهمل زوجته عن دون قصد.';
        astrologyDiscribe +=
            'رجل برج الدلو يعشق أولاده ويحبهم حباً شديداً، مما يدفعه للاهتمام بهم وكذلك بألعابهم وعاداتهم وجميع ما يخصهم سواء من قريب أو من بعيد، ومن حسناته كأب امتلاكه القدرة على الإصغاء لأحاديث الصغار حتى لو دامت لفترة طويلة من دون أن يشعر بالملل أو الضيق، ويعرف عنه عدم نسيانه لحبه الأول وعودته إليه، إذا سمحت الظروف، حتى لو بعد سنين طويلة، وسواء ارتبط هذا الرجل بصديقة الطفولة أو لم يرتبط بها، فبدون شك أن المرأة التي سيختارها قلبه ستجد نفسها كأنها "أليس في بلاد العجائب"';
      } else {}
    } else if (month == 2 && day >= 20 || month == 3 && day <= 20) {
      astrology = "برج الحوت";
      if (male) {
        astrologyDiscribe =
            'يمرّ الحظ في بعض الأحيان بقرب الرجل الحوت فنراه يحلم أو يتأمل لمعان نجم في السماء، الا أنه يترك هذا الحظ الذي يأتيه ذاهبا لأشخاص آخريـن بدون أن يدرك أبدا أنه خسر فرصة نجاح حقيقية، هل يُسمى هذا ضعفاً أم فشلا ً؟ الجواب لا هذا ولا ذاك، فبامكان هذا الرجل االبحث عن الرزق ان أراد، والوصول إلى أعلى مراكز النجاح بفضل حدسه الذي ورثه عن الإله نبتون.';
        astrologyDiscribe +=
            'من أبرز ملامح شخصية رجل الحوت امتلاكه للفضول الخالي من سواد النية أو الدهشة أو حتى المقاضاة لسلوك الغير، تراه يُـثرثر في بعض الأحيان بدون تفكير، مما يجعله يكشف عن بعض الأسرار الخاصة بغيره دون قصد، الا أنه يرفض بالمقابل البوح بأمر ما مهما تكن الأسباب أوالظروف إن طـُلب منه الكتمان، يتحدث بود، ويفكر بهدوء، ويحاول الا يتدخل فيما لا يعنيه، الا أن مشاكل الغير تلاحقه رغما عنه، وقد يكون السبب في ذلك موهبة الإصغاء عنده، وتمكنه من امتصاص الآلام والأحزان، التي يتعامل معها وكأنها ملكه الخاص، من المفترض على أصدقائه وأقاربه مراعاة صحته، وعدم تحميله أكثر من استطاعته، وأن يقدروا حاجته للراحة والصمت والعزلة، حتى يتمكن من استعادة ما فقده لأجلهم من نشاط وحيوية، ان هذا الرجل إنسان يتصف بالخجل والحساسة، انه يُجرَح بسرعة، ويحتاج من الآخرين ابداء الإعجاب به وتشجيعه لاعتقاده أنه قليل الكفاءة، ومع ذلك يمتلك قابلية عظيمة للعديد من الأشياء كاليوغا والسحر والفلك والتقمص وكل العلوم الباطنية الأخرى، بامكانه قراءة الأفكار، ومعرفة ماذا يمكن أن يحدث، يتـظاهر بعكس ما يكن أحيانا، وهو بامتلاكه لعدة أسرار يشعر بالراحة والطمأنينة.';
        astrologyDiscribe +=
            'ينتظر هذا الرجل من شريكته التي يُحبها الإخلاص الكامل والوفاء التام، وفي نفس الوقت لا يقبل التخلــّي عن أصدقائه من مختلف الجنسين الذيـن يقومون على خدمته بكافة الوسائل وفي كافة الأوقات، الأمر الذي يُشعل غيرة شريكته ونقمتها رغما عنها .. يعجب كثيرا بالجمال، ولا يتردد بالقيام بملاحقة النساء بنظراته التي تعبر عن إحساسه وشعوره، حتى لو نتج عن هذا سوء تفاهم مع المرأة التي يحبها، ويمر رجل الحوت في مرحلة قلق وكآبة لا يدرك مصدرهما فيضطر للانزواء في انتظار اتيان اقتراح من زوجته يساعده على تبديل مزاجه المُتعكر، والرجل من برج الحوت هو شخص مُبذر لا يمكنه التوفير إلا بمرور الوقت وبالحصول على مساعدة زوجته التي بامكانها أن تكون مثله الأعلى في هذا المجال .. هو لأطفاله أكثر من أب، فهو الصديق الذي يُرافقهم للنزهات والرحلات البحرية ويُعلمهم أساسيات السباحة والتجديف واليوغا والكثير من الأمور الأخرى، وهو أيضا مربّي طيب القلب وليـّن الطباع يستمع للمشاكل والمآسي بكل حواسه، أما طريقة التصلب والقسوة فلا يُجيدها ولا يُحب استعمالها، ويُفضل أن تكون من اختصاص زوجته.';
        astrologyDiscribe +=
            'هذا الإنسان يمكنه التخلي عن كل شيء الا أحلامه التي تعد بمثابة روحه، فإذا كانت زوجته تريد الاحتفاظ بحبه إلى الأبد، والابقاء على سعادة عائلتها، عليها أن تقدر هذه الأحلام ولا تسخر منها بأي طريقة من الطرق، وبامكانها بدلا من ذلك، أن تـُشجعه على تغييرها كلها أو بعضا منها إلى واقع مفيد وإيجابي';
      } else {}
    }
  }

  @override
  Widget build(BuildContext context) {
    double heigh = MediaQuery.of(context).size.height;
    double width = MediaQuery.of(context).size.width;

    return WillPopScope(
      onWillPop: _onBackPressed,
      child: Scaffold(
        backgroundColor: Color(0xFF5e5b52),
        body: StreamBuilder(
            stream: Firestore.instance
                .collection('users')
                .where('email', isEqualTo: widget.userEmail)
                .snapshots(),
            builder: (context, snapshot) {
              if (!snapshot.hasData) {
                return Container();
              } else {
                DateTime d = snapshot.data.documents[0].data['DOB'].toDate();
                DateTime today = DateTime.now();
                AgeDuration age;

                // Find out your age
                age = Age.dateDifference(
                    fromDate: d, toDate: today, includeToDate: false);
                getAstrology(
                    d.month, d.day, snapshot.data.documents[0].data['isMale']);

                return Container(
                  child: Stack(
                    children: [
                      galaryIcon(imageSourceVisible, _takeFromGalary),
                      cameraIcon(imageSourceVisible, _takePicture),
                      bigImage(heigh, snapshot.data.documents[0].data['image']),
                      widget.roomID == null
                          ? myImageProfile(choosrImageSource,
                              snapshot.data.documents[0].data['image'])
                          : userImageProfile(
                              snapshot.data.documents[0].data['image']),
                      userinfo(
                        context,
                        widget.userName,
                        snapshot.data.documents[0].data['isMale'],
                        age.years.toString(),
                        astrology,
                        astrologyDiscribe,
                      ),
                      widget.roomID == null
                          ? myProfile()
                          : userProfileButtonToChatConversation(
                              context,
                              widget.userName,
                              widget.roomID,
                              widget.userEmail,
                              widget.userImage,
                              snapshot.data.documents[0].data['isMale'],
                            ),
                    ],
                  ),
                );
              }
            }),
      ),
    );
  }

  choosrImageSource() {
    setState(() {
      imageSourceVisible = !imageSourceVisible;
    });
  }

  File imageStored;
  String urlImage;

  final picker = ImagePicker();
  _takeFromGalary() async {
    final pickedFile = await picker.getImage(
        source: ImageSource.gallery, imageQuality: 100, maxWidth: 1200);
    setState(() {
      try {
        imageStored = File(pickedFile.path);
      } catch (e) {}
    });
    uploadImage();
    imageSourceVisible = false;
  }

  _takePicture() async {
    final pickedFile = await picker.getImage(
        source: ImageSource.camera, imageQuality: 100, maxWidth: 1200);
    setState(() {
      try {
        imageStored = File(pickedFile.path);
      } catch (e) {}
    });
    uploadImage();
    imageSourceVisible = false;
  }

  Future uploadImage() async {
    String fileName = '${DateTime.now()}.png';

    StorageReference firebaseStorage =
        FirebaseStorage.instance.ref().child(fileName);

    StorageUploadTask uploadTask = firebaseStorage.putFile(imageStored);
    await uploadTask.onComplete;
    urlImage = await firebaseStorage.getDownloadURL() as String;

    if (urlImage.isNotEmpty) {
      Database().getUserID(Constanse.myEmail).then((v) {
        v.documents.forEach((result) async {
          Firestore.instance
              .collection('users')
              .document(result.documentID)
              .updateData({
            "image": urlImage,
          });

          HelperFunction.saveUserImage(urlImage);
          Constanse.myImage = await HelperFunction.getUserImage();
          setState(() {});
        });
      });
    }
  }
}
